{"dataset_id": "8wbx-tsch", "title": "For Hire Vehicles (FHV) - Active", "original_description": "<b>PLEASE NOTE:</b> This dataset, which includes all TLC licensed for-hire vehicles which are in good standing and able to drive, is updated every day in the evening between 4-7pm. Please check the 'Last Update Date' field to make sure the list has updated successfully. 'Last Update Date'  should show either today or yesterday's date, depending on the time of day. If the list is outdated, please download the most recent list from the link below. \r\nhttp://www1.nyc.gov/assets/tlc/downloads/datasets/tlc_for_hire_vehicle_active_and_inactive.csv\r\n\r\nTLC authorized For-Hire vehicles that are active. This list is accurate to the date and time represented in the Last Date Updated and Last Time Updated fields. For inquiries about the contents of this dataset, please email licensinginquiries@tlc.nyc.gov.", "topic": "Transportation", "ufd": "This dataset contains information on active for-hire vehicles licensed by the TLC. It is updated daily and includes details such as vehicle license number, driver name, license type, and expiration date. Key columns include `vehicle_license_number`, `name` of the driver, `license_type` which is consistently \"FOR HIRE VEHICLE\", and `expiration_date` of the license. The dataset also provides information about the base or company the vehicle is associated with, including `base_number`, `base_name`, `base_type` (e.g., BLACK-CAR, LIVERY), `base_telephone_number`, and `base_address`. Researchers and transportation planners can use this dataset to analyze trends in the for-hire vehicle industry, track vehicle and driver licensing, and understand the distribution of different base types across the city. The `active` column indicates whether a vehicle is currently in good standing and authorized to operate. The `vehicle_year` column can be used to assess the age and potential environmental impact of the for-hire vehicle fleet.", "sfd": "Dataset Overview:\nThis dataset provides daily updates on active for-hire vehicles licensed by the TLC, including vehicle and driver details, license information, and base affiliations. It contains information such as vehicle license number, driver name, license type, expiration date, and base details like name, type, and contact information. The dataset is useful for analyzing trends in the for-hire vehicle industry and tracking licensing information.\n\nRelated Topics:\n- For-Hire Vehicles\n- Transportation Network Companies (TNCs)\n- Vehicle Licensing\n- Driver Licensing\n- Transportation Planning\n- Urban Mobility\n- Taxi and Limousine Commission (TLC)\n- Base Stations\n\nConcepts and Synonyms:\n- For-Hire Vehicle: FHV, Taxi, Livery Vehicle, Black Car\n- Base: Dispatch Center, Company, Affiliated Organization\n- License: Permit, Authorization, Credential\n- Active: In Good Standing, Valid, Authorized to Operate\n- TLC: Taxi and Limousine Commission, Regulatory Agency\n- Vehicle: Automobile, Car, Motor Vehicle\n\nApplications and Use Cases:\n- Analyze the growth and distribution of for-hire vehicles.\n- Track vehicle and driver licensing trends over time.\n- Identify the distribution of different base types (e.g., black car, livery) across the city.\n- Assess the age and potential environmental impact of the for-hire vehicle fleet using the `vehicle_year` column.\n- Investigate the relationship between base characteristics and vehicle activity.\n- Monitor compliance with licensing regulations.\n- Develop transportation planning strategies based on for-hire vehicle data."}
{"dataset_id": "vx8i-nprf", "title": "Civil Service List (Active)", "original_description": "A Civil Service List consists of all candidates who passed an exam, ranked in score order. An established list is considered active for no less than one year and no more than four years from the date of establishment. For more information visit DCAS’ “Work for the City” webpage at: https://www1.nyc.gov/site/dcas/employment/take-an-exam.page", "topic": "City Government", "ufd": "This dataset contains information about active civil service lists, which are rankings of candidates who passed an exam for city government positions. Each row represents a candidate on a list and includes their exam number, name, and adjusted final average score (\"adj_fa\"). The dataset also provides details about the specific job title (\"list_title_desc\"), the agency associated with the list (\"list_agency_desc\"), and important dates such as when the list was established and its anniversary date. Researchers or job seekers might use this data to analyze trends in civil service hiring, explore the types of positions available, or track the lifecycle of different civil service lists. Note that some columns, such as \"published_date\" and \"extension_date,\" have a high percentage of missing values. The \"exam_no\" column serves as a unique identifier for each exam.", "sfd": "Dataset Overview:\nThis dataset provides details on active civil service lists within a city government, including candidate rankings, exam scores, and list-specific information. It contains data on individuals who have passed civil service exams and are eligible for various government positions. The dataset includes details such as exam number, candidate name, adjusted final average score, job title, agency, and key dates related to the list's lifecycle.\n\nRelated Topics:\n- Civil Service\n- Government Jobs\n- Public Sector Employment\n- Hiring Processes\n- Exam Results\n- Candidate Rankings\n\nConcepts and Synonyms:\n- Civil Service List: Eligible candidate list, hiring roster, employment register\n- Exam Number: Test ID, Examination identifier\n- Adjusted Final Average Score: Adj_FA, Final score, Exam performance\n- List Title Description: Job title, Position name, Role description\n- List Agency Description: Department, Government agency, Hiring organization\n\nApplications and Use Cases:\n- Analyze trends in civil service hiring across different agencies and job titles.\n- Explore the distribution of exam scores and identify high-performing candidates.\n- Track the lifecycle of civil service lists, including establishment and expiration dates.\n- Investigate the relationship between exam scores and job placement outcomes (if linked to other datasets).\n- Identify potential areas for improvement in the civil service examination process."}
{"dataset_id": "k397-673e", "title": "Citywide Payroll Data (Fiscal Year)", "original_description": "Data is collected because of public interest in how the City’s budget is being spent on salary and overtime pay for all municipal employees. Data is input into the City's Personnel Management System (“PMS”) by the respective user Agencies. Each record represents the following statistics for every city employee: Agency, Last Name, First Name, Middle Initial, Agency Start Date, Work Location Borough, Job Title Description, Leave Status as of the close of the FY (June 30th), Base Salary, Pay Basis, Regular Hours Paid, Regular Gross Paid, Overtime Hours worked, Total Overtime Paid, and Total Other Compensation (i.e. lump sum and/or retro payments). This data can be used to analyze how the City's financial resources are allocated and how much of the City's budget is being devoted to overtime. The reader of this data should be aware that increments of salary increases received over the course of any one fiscal year will not be reflected. All that is captured, is the employee's final base and gross salary at the end of the fiscal year.  In very limited cases, a check replacement and subsequent refund may reflect both the original check as well as the re-issued check in employee pay totals.  \r\n<br>\r\n<b>NOTE 1: </b>To further improve the visibility into the number of employee OT hours worked, beginning with the FY 2023 report, an updated methodology will be used which will eliminate redundant reporting of OT hours in some specific instances.  In the previous calculation, hours associated with both overtime pay as well as an accompanying overtime “companion code” pay were included in the employee total even though they represented pay for the same period of time.  With the updated methodology, the dollars shown on the Open Data site will continue to be inclusive of both types of overtime, but the OT hours will now reflect a singular block of time, which will result in a more representative total of employee OT hours worked.   The updated methodology will primarily impact the OT hours associated with City employees in uniformed civil service titles.  The updated methodology will be applied to the Open Data posting for Fiscal Year 2023 and cannot be applied to prior postings and, as a result, the reader of this data should not compare OT <b>hours</b>  prior to the 2023 report against OT hours published starting Fiscal Year 2023.  The reader of this data may continue to compare OT <b>dollars</b> across all published Fiscal Years on Open Data. \r\n<br>\r\n<b>NOTE 2: </b>As a part of FISA-OPA’s routine process for reviewing and releasing Citywide Payroll Data, data for some agencies (specifically NYC Police Department (NYPD) and the District Attorneys’ Offices (Manhattan, Kings, Queens, Richmond, Bronx, and Special Narcotics)) have been redacted since they are exempt from disclosure pursuant to the Freedom of Information Law, POL § 87(2)(f), on the ground that disclosure of the information could endanger the life and safety of the public servants listed thereon. They are further exempt from disclosure pursuant to POL § 87(2)(e)(iii), on the ground that any release of the information would identify confidential sources or disclose confidential information relating to a criminal investigation, and POL § 87(2)(e)(iv), on the ground that disclosure would reveal non-routine criminal investigative techniques or procedures. Some of these redactions will appear as XXX in the name columns.", "topic": "City Government", "ufd": "This dataset provides a snapshot of citywide payroll information for the fiscal year 2025, focusing on employees within the \"ADMIN FOR CHILDREN'S SVCS\" agency. Each row represents an individual employee and includes details such as their name, agency start date, and work location borough. The dataset also contains information about the employee's job title, leave status, and compensation. Key columns include `base_salary`, `regular_gross_paid`, `total_ot_paid`, and `total_other_pay`, offering a comprehensive view of employee earnings. Researchers and analysts can use this data to understand payroll distribution within the agency, analyze overtime spending, and examine compensation trends across different job titles and boroughs. Please note that this sample only contains data from a single agency and fiscal year. The dataset includes the regular hours worked by each employee, as well as overtime hours.", "sfd": "Dataset Overview:\nThis dataset contains payroll information for employees within the \"ADMIN FOR CHILDREN'S SVCS\" agency for fiscal year 2025. It includes details such as employee name, start date, borough, job title, leave status, and various compensation components like base salary, regular gross pay, overtime pay, and other pay. The data also includes regular and overtime hours worked.\n\nRelated Topics:\n- City Government Payroll\n- Public Sector Compensation\n- Government Employee Data\n- Child Services Administration\n- Municipal Finance\n- Human Resources\n\nConcepts and Synonyms:\n- Payroll: Salary, Wages, Compensation, Earnings, Remuneration\n- Agency: Department, Bureau, Division, Administration\n- Employee: Staff, Personnel, Worker\n- Fiscal Year: Financial Year, Budget Year\n- Overtime: OT, Extra Hours, Premium Pay\n- Base Salary: Annual Salary, Regular Pay, Fixed Salary\n\nApplications and Use Cases:\n- Analyze payroll distribution within the \"ADMIN FOR CHILDREN'S SVCS\" agency.\n- Examine overtime spending and trends.\n- Compare compensation across different job titles and boroughs.\n- Identify potential pay disparities.\n- Calculate average salaries for specific roles.\n- Understand the impact of leave status on employee earnings."}
{"dataset_id": "h9gi-nx95", "title": "Motor Vehicle Collisions - Crashes", "original_description": "The Motor Vehicle Collisions crash table contains details on the crash event. Each row represents a crash event. The Motor Vehicle Collisions data tables contain information from all police reported motor vehicle collisions in NYC. The police report (MV104-AN) is required to be filled out for collisions where someone is injured or killed, or where there is at least $1000 worth of damage (https://www.nhtsa.gov/sites/nhtsa.dot.gov/files/documents/ny_overlay_mv-104an_rev05_2004.pdf).  It should be noted that the data is preliminary and subject to change when the MV-104AN forms are amended based on revised crash details.For the most accurate, up to date statistics on traffic fatalities, please refer to the <a href=\"https://www1.nyc.gov/site/nypd/stats/traffic-data/traffic-data-collision.page\" style=\"color:#187bcd;\">NYPD Motor Vehicle Collisions page</a> (updated weekly) or <a href=\"http://www.nycvzv.info/\" style=\"color:#187bcd;\">Vision Zero View</a> (updated monthly).\r\n\r\n</p>\r\nDue to success of the CompStat program, NYPD began to ask how to apply the CompStat principles  to other problems.  Other than homicides, the fatal incidents with which police have the most contact with the public are fatal traffic collisions.  Therefore in April 1998, the Department implemented TrafficStat, which uses the CompStat model to work towards improving traffic safety.  Police officers complete form MV-104AN  for all vehicle collisions.  The MV-104AN is a New York State form that has all of the details of a traffic collision.  Before implementing Trafficstat, there was no uniform traffic safety data collection procedure for all of the NYPD precincts.  Therefore, the Police Department implemented the Traffic Accident Management System (TAMS) in July 1999 in order to collect traffic data in a uniform method across the City.  TAMS required the precincts manually enter a few selected MV-104AN fields to collect very basic intersection traffic crash statistics which included the number of accidents, injuries and fatalities. As the years progressed, there grew a need for additional traffic data so that more detailed analyses could be conducted. The Citywide traffic safety initiative, Vision Zero started in the year 2014.  Vision Zero further emphasized the need for the collection of more traffic data in order to work towards the Vision Zero goal, which is to eliminate traffic fatalities.  Therefore, the Department in March 2016 replaced the TAMS with the new Finest Online Records Management System (FORMS).  FORMS enables the police officers to electronically, using a Department cellphone or computer, enter all of the MV-104AN data fields and stores all of the MV-104AN data fields in the Department’s crime data warehouse.  Since all of the MV-104AN data fields are now stored for each traffic collision, detailed traffic safety analyses can be conducted as applicable.", "topic": "Public Safety", "ufd": "This dataset contains information about motor vehicle collisions in New York City, with each row representing a single crash event. Key details include the crash date and time, the streets where the collision occurred (on_street_name, off_street_name), and the number of people injured or killed. The dataset also provides insights into the factors contributing to the crash, such as driver inattention or speeding, and the types of vehicles involved. Researchers and public safety officials can use this data to identify high-risk areas, understand the causes of collisions, and develop strategies to improve traffic safety. The data includes the number of injuries and fatalities for different types of people involved, such as pedestrians, cyclists, and motorists. This information can be used to analyze trends and patterns in collisions, and to evaluate the effectiveness of safety interventions.", "sfd": "Dataset Overview:\nThis dataset details motor vehicle collisions in New York City, with each entry representing a single crash. It includes the date, time, and location of the crash, along with the number of injuries and fatalities. Contributing factors like driver inattention and vehicle types are also recorded, providing a comprehensive view of collision events.\n\nRelated Topics:\n- Traffic Safety\n- Urban Planning\n- Public Health\n- Accident Analysis\n- Transportation Engineering\n\nConcepts and Synonyms:\n- Motor Vehicle Collision: Car accident, traffic crash, vehicle collision, road accident\n- Injuries: Wounded, harmed, casualties, injured persons\n- Fatalities: Deaths, killed, mortalities, deceased\n- Contributing Factors: Causes, reasons, contributing circumstances, accident factors\n- Vehicle Types: Car, truck, motorcycle, bus, taxi, bicycle, pedestrian\n\nApplications and Use Cases:\n- Identify high-risk areas for collisions.\n- Analyze the causes of motor vehicle accidents.\n- Develop strategies to improve traffic safety.\n- Evaluate the effectiveness of safety interventions.\n- Analyze trends and patterns in collisions involving pedestrians and cyclists.\n- Predict future collision hotspots based on historical data."}
{"dataset_id": "xjfq-wh2d", "title": "For Hire Vehicles (FHV) - Active Drivers", "original_description": "<b>PLEASE NOTE:</b> This dataset, which includes all TLC licensed for-hire drivers which are in good standing and able to drive, is updated every day in the evening between 4-7pm. Please check the 'Last Update Date' field to make sure the list has updated successfully. 'Last Update Date'  should show either today or yesterday's date, depending on the time of day. If the list is outdated, please download the most recent list from the link below. \r\nhttp://www1.nyc.gov/assets/tlc/downloads/datasets/tlc_for_hire_vehicle_drivers_active.csv\r\n\r\nNYC TLC Licensed FHV drivers that are currently active and in good standing. This list is accurate to the date and time represented in the Last Date Updated and Last Time Updated fields. For inquiries about the contents of this dataset, please email licensinginquiries@tlc.nyc.gov.", "topic": "Transportation", "ufd": "This dataset contains information on active, licensed For Hire Vehicle (FHV) drivers in New York City. Each row represents a driver and includes their license number, name, and the expiration date of their license. The \"wheelchair_accessible_trained\" column indicates whether the driver is trained to operate wheelchair-accessible vehicles. The dataset is updated daily, and the \"last_date_updated\" and \"last_time_updated\" columns reflect the last time the data was refreshed. This information can be used to verify the status and credentials of FHV drivers. You can also use this dataset to analyze trends in FHV driver licensing and wheelchair accessibility within the FHV sector.", "sfd": "Dataset Overview:\nThis dataset provides details on active, licensed For Hire Vehicle (FHV) drivers in New York City. It includes driver license information, name, license expiration date, and wheelchair accessibility training status. The dataset is updated daily, offering a current snapshot of FHV driver credentials and training.\n\nRelated Topics:\n- For Hire Vehicles (FHV)\n- Transportation Licensing\n- Driver Credentials\n- Wheelchair Accessibility\n- New York City Transportation\n- Regulatory Compliance\n\nConcepts and Synonyms:\n- For Hire Vehicle (FHV): Taxi, Livery, Black Car, Rideshare\n- License: Permit, Credential, Authorization\n- Wheelchair Accessible Trained: Accessibility Certification, ADA Compliant Driver\n- Expiration Date: License Renewal Date, Validity Period\n- Active Driver: Licensed Driver, Operating Driver\n\nApplications and Use Cases:\n- Verify the license status of FHV drivers.\n- Analyze trends in FHV driver licensing over time.\n- Assess the number of wheelchair-accessible trained drivers.\n- Develop applications for driver verification and compliance.\n- Track changes in the FHV driver population."}
{"dataset_id": "a9md-ynri", "title": "Civil Service List Certification", "original_description": "A List Certification includes the names of eligible candidates on an Active Civil Service List that has been established.  The Certification may contain part of a list, the whole list, or multiple lists at the request of an appointing agency, to fill vacancies and/or replace provisionals.  Eligible candidates on a Certification may be considered for probable appointment at the appointing Agency.  For more information visit DCAS’ “Work for the City” webpage at: https://www1.nyc.gov/site/dcas/employment/take-an-exam.page", "topic": "City Government", "ufd": "This dataset contains information on Civil Service List Certifications, which are lists of eligible candidates for city government positions. Each row represents a candidate on a certification list. Key details include the candidate's name, the agency and job title they are being considered for, and the date the certification was requested and issued. The dataset also includes salary information and the number of vacancies for the position. Researchers and job seekers can use this data to understand the hiring process for city government jobs, identify in-demand skills and agencies, and track the timelines associated with civil service certifications. The `exam_no` and `list_agency_code` columns provide unique identifiers for exams and agencies, while `list_title_desc` specifies the job title. The `request_date`, `cert_date`, and `cert_expiration_date` columns offer a timeline of the certification process.", "sfd": "Dataset Overview:\nThis dataset provides comprehensive information on Civil Service List Certifications within a city government, detailing eligible candidates for various positions. Each record represents a candidate's listing, including their name, the agency and job title, and key dates related to the certification process. Salary information and vacancy counts are also included, offering insights into the hiring landscape.\n\nRelated Topics:\n- City Government Jobs\n- Civil Service Exams\n- Public Sector Employment\n- Hiring Processes\n- Government Transparency\n- Human Resources\n\nConcepts and Synonyms:\n- Civil Service List Certification: Eligibility List, Candidate Roster, Hiring Pool\n- Agency: Department, Bureau, Division\n- Job Title: Position, Occupation, Role\n- Request Date: Application Date, Submission Date\n- Cert Date: Certification Date, Approval Date, Issuance Date\n- Vacancy: Opening, Available Position, Job Opening\n- Exam Number: Test ID, Examination Code\n\nApplications and Use Cases:\n- Analyze hiring trends across different city agencies.\n- Identify in-demand job titles and associated salary ranges.\n- Track the time elapsed between certification request and issuance.\n- Investigate the relationship between exam scores and certification outcomes (if exam scores were present in the dataset).\n- Develop tools for job seekers to identify relevant opportunities and understand the civil service hiring process.\n- Evaluate the effectiveness of recruitment strategies by analyzing vacancy fill rates."}
{"dataset_id": "43nn-pn8j", "title": "DOHMH New York City Restaurant Inspection Results", "original_description": "The dataset contains every sustained or not yet adjudicated violation citation from every full or special program inspection conducted up to three years prior to the most recent inspection for restaurants and college cafeterias in an active status on the RECORD DATE (date of the data pull). When an inspection results in more than one violation, values for associated fields are repeated for each additional violation record.  Establishments are uniquely identified by their CAMIS (record ID) number. Keep in mind that thousands of restaurants start business and go out of business every year; only restaurants in an active status are included in the dataset. \r\nRecords are also included for each restaurant that has applied for a permit but has not yet been inspected and for inspections resulting in no violations. Establishments with inspection date of 1/1/1900 are new establishments that have not yet received an inspection. Restaurants that received no violations are represented by a single row and coded as having no violations using the ACTION field. \r\nBecause this dataset is compiled from several large administrative data systems, it contains some illogical values that could be a result of data entry or transfer errors. Data may also be missing. \r\nThis dataset and the information on the Health Department’s Restaurant Grading website come from the same data source.  The Health Department’s Restaurant Grading website is here: \r\nhttp://www1.nyc.gov/site/doh/services/restaurant-grades.page\r\nSee the data dictionary file in the Attachments section of the OpenData website for a summary of data fields and allowable values.", "topic": "Health", "ufd": "This dataset contains restaurant inspection results for New York City, offering insights into the health and safety standards of local eateries. Each row represents a specific inspection record, identified by a unique CAMIS number. Key details include the restaurant's name (DBA), location (Boro, Building, Street, Zipcode, Latitude, Longitude), and inspection date. The dataset highlights critical violations (Critical_flag), cuisine type, and any actions taken as a result of the inspection. Researchers, health officials, and the public can use this data to assess restaurant compliance, identify trends in food safety, and make informed decisions about dining options. Note that an inspection date of 1900-01-01 indicates that the restaurant is new and has not yet been inspected. The record date indicates when the data was pulled.", "sfd": "Dataset Overview:\nThis dataset provides detailed restaurant inspection results for New York City, encompassing key information about food safety and hygiene standards. Each record represents a single inspection, including restaurant details, violation specifics, and inspection outcomes. The data allows for analysis of restaurant compliance and identification of food safety trends.\n\nRelated Topics:\n- Food Safety\n- Public Health\n- Restaurant Hygiene\n- New York City\n- Inspections\n- Compliance\n- Health Violations\n\nConcepts and Synonyms:\n- Restaurant Inspection: Food safety inspection, health inspection, eatery evaluation\n- Violation: Infraction, deficiency, non-compliance, health code violation\n- CAMIS: Restaurant ID, establishment identifier\n- DBA: Doing Business As, restaurant name, business name\n- Boro: Borough, district, region\n- Critical Flag: Critical violation, high-risk violation, severe infraction\n- Inspection Date: Date of inspection, evaluation date\n\nApplications and Use Cases:\n- Identifying restaurants with repeated violations.\n- Analyzing trends in food safety across different boroughs.\n- Developing predictive models for restaurant inspection outcomes.\n- Providing consumers with information to make informed dining choices.\n- Evaluating the effectiveness of food safety regulations.\n- Mapping restaurant inspection scores and violations geographically."}
{"dataset_id": "tg4x-b46p", "title": "Film Permits", "original_description": "Permits are generally required when asserting the exclusive use of city property, like a sidewalk, a street, or a park. See http://www1.nyc.gov/site/mome/permits/when-permit-required.page", "topic": "City Government", "ufd": "This dataset contains information about permits required for exclusive use of city property in New York City, with a focus on film and media productions. Each row represents a permit, identified by a unique `eventid`, and includes details such as the `eventtype` (e.g., Shooting Permit, Theater Load in), `startdatetime` and `enddatetime` of the permitted activity. The `eventagency` is the Mayor's Office of Media & Entertainment. Location information is provided through `parkingheld` (street address), `borough`, `communityboard_s`, `policeprecinct_s`, and `zipcode_s`. The dataset also categorizes the type of production (`category` and `subcategoryname`), such as Television (Cable-episodic) or Film (Feature). You can use this dataset to analyze trends in film and media production across different boroughs, identify frequently requested locations, or understand the duration of permitted activities.", "sfd": "Dataset Overview:\nThis dataset details permits issued by New York City for exclusive use of city property, primarily focusing on film and media productions. Each record represents a unique permit, identified by an event ID, and includes information about the event type, date and time, location, and the type of production. The data is managed by the Mayor's Office of Media & Entertainment.\n\nRelated Topics:\n- Film Permits\n- Media Production\n- City Planning\n- Location Management\n- Event Management\n- New York City Government\n- Public Space Usage\n\nConcepts and Synonyms:\n- Permit: Authorization, License, Approval\n- Event ID: Event ID, Unique Identifier, Record Number\n- Event Type: Activity Type, Permit Category, Usage Type (e.g., Shooting Permit, Theater Load in)\n- Event Agency: Issuing Agency, Responsible Department, Mayor's Office of Media & Entertainment (MOME)\n- Location: Site, Address, Borough, Community Board, Police Precinct, Zip Code\n- Production Type: Category, Subcategory, Film, Television, Commercial\n\nApplications and Use Cases:\n- Analyze trends in film and media production activity across different boroughs.\n- Identify popular filming locations and their usage patterns.\n- Understand the duration and scheduling of permitted activities.\n- Optimize permit allocation and resource management.\n- Track the economic impact of film and media production in NYC.\n- Visualize permit distribution on a map."}
{"dataset_id": "ipu4-2q9a", "title": "DOB Permit Issuance", "original_description": "The Department of Buildings (DOB) issues permits for construction and demolition activities in the City of New York. The construction industry must submit an application to DOB with details of the construction job they would like to complete. The primary types of application, aka job type, are: New Building, Demolition, and Alterations Type 1, 2, and 3. Each job type can have multiple work types, such as general construction, boiler, elevator, and plumbing. Each work type will receive a separate permit. (See the DOB Job Application Filings dataset for information about each job application.) Each row/record in this dataset represents the life cycle of one permit for one work type. The dataset is updated daily with new records, and each existing record will be updated as the permit application moves through the approval process to reflect the latest status of the application.", "topic": "Housing & Development", "ufd": "This dataset contains information about permits issued by the New York City Department of Buildings (DOB) for construction and demolition activities. Each row represents a single permit for a specific type of work, updated daily to reflect the latest application status. Key columns include `borough`, `bin__` (Building Identification Number), `house__` and `street_name` to identify the location of the permitted work. The `job__` column provides a unique identifier for the overall construction job, while `job_type` specifies the type of application (e.g., New Building, Demolition). Dates such as `filing_date`, `issuance_date`, and `expiration_date` track the permit's lifecycle. Researchers, developers, and city planners can use this dataset to analyze construction trends, track permit approvals, and understand development patterns across New York City. The data also includes details about the permittee and property owner, offering insights into the stakeholders involved in construction projects.", "sfd": "Dataset Overview:\nThis dataset details construction and demolition permits issued by the NYC Department of Buildings (DOB). It includes information on permit type, location (borough, BIN, address), key dates (filing, issuance, expiration), and involved parties. Updated daily, the data allows for tracking construction activity and development trends across New York City.\n\nRelated Topics:\n- Construction Permits\n- Building Permits\n- Real Estate Development\n- Urban Planning\n- New York City\n- Housing Development\n- Demolition\n- Property Data\n\nConcepts and Synonyms:\n- Building Identification Number (BIN)\n- Job Number (Job__)\n- Permit Filing Date (Filing_Date)\n- Permit Issuance Date (Issuance_Date)\n- Permit Expiration Date (Expiration_Date)\n- Borough (e.g., Manhattan, Brooklyn, Queens)\n- Job Type (e.g., New Building, Demolition, Alteration)\n- DOB (Department of Buildings)\n- Construction Activity\n- Development Trends\n\nApplications and Use Cases:\n- Analyze construction and demolition trends across different boroughs of NYC.\n- Track the approval process and timelines for building permits.\n- Identify areas with high levels of construction activity.\n- Investigate the relationship between permit issuance and property values.\n- Develop predictive models for future construction activity.\n- Identify potential construction projects for investment opportunities.\n- Monitor compliance with building codes and regulations.\n- Visualize construction patterns and development over time."}
{"dataset_id": "nc67-uf89", "title": "Open Parking and Camera Violations", "original_description": "The Open Parking and Camera Violations dataset was initially loaded with all violations contained in the mainframe database as of May 2016. Subsequent new violation issuance and updates to existing violations are applied to this data set on the following schedule:\r\n</p>\r\n\tNew or open violations will be updated weekly (Sunday).\r\nViolations satisfied by having been paid, dismissed via hearing, statutorily expired, or had other changes to its status, will be updated daily (Tuesday through Sunday).\r\nViolations that have been written-off because they have statutorily expired and are no longer valid are indicated with blank financials.\r\nSummons images will not be available during scheduled downtime on Sundays from 5:00 am to 10:00 am.\r\n\r\n</p>* Initial dataset loaded 05/14/2016.", "topic": "City Government", "ufd": "This dataset contains information on parking and camera violations issued in New York City. Each row represents a single violation, with details such as the license plate, state, and type of license involved. The dataset includes the date and time the violation was issued, as well as the specific violation type (e.g., \"NO PARKING-STREET CLEANING\" or \"PHTO SCHOOL ZN SPEED VIOLATION\"). Financial information, including fine amount, penalty amount, interest, and payments, is provided, along with the amount still due. You can also find the precinct and county where the violation occurred, and the issuing agency. A link to an image of the summons is included for each violation. This data could be used to analyze parking violation patterns, assess revenue generated from fines, or examine the effectiveness of different traffic regulations.", "sfd": "**Dataset Overview:**\nThis dataset details parking and camera violations issued in New York City. Each record represents a single violation and includes information on the vehicle, violation details, financial aspects, and location. It provides a comprehensive view of traffic violations within the city.\n\n**Related Topics:**\n*   Traffic Violations\n*   Urban Planning\n*   Municipal Finance\n*   Law Enforcement\n*   New York City\n*   Government Data\n\n**Concepts and Synonyms:**\n*   Parking Violation: Parking Ticket, Summons, Notice of Violation (NOV)\n*   Camera Violation: Automated Enforcement, Speed Camera, Red Light Camera\n*   Fine Amount: Penalty, Assessment, Charge\n*   Due Amount: Balance, Outstanding Payment, Amount Owed\n*   Precinct: Police District, Local Command\n*   Issuing Agency: Department of Transportation (DOT), Police Department (NYPD)\n\n**Applications and Use Cases:**\n*   Analyze parking violation hotspots across the city.\n*   Assess the revenue generated from parking and camera violations.\n*   Evaluate the effectiveness of specific traffic regulations.\n*   Identify trends in violation types over time.\n*   Develop predictive models for future violation occurrences.\n*   Study the impact of traffic violations on different communities.\n*   Examine the correlation between violation types and vehicle characteristics.\n*   Investigate the efficiency of the violation payment process."}
{"dataset_id": "jb3k-j3gp", "title": "Medallion Drivers - Active", "original_description": "<b>PLEASE NOTE:</b> This dataset, which includes all TLC Licensed Drivers who are in good standing and able to drive, is updated every day in the evening between 4-7pm. Please check the 'Last Update Date' field to make sure the list has updated successfully. 'Last Update Date'  should show either today or yesterday's date, depending on the time of day. If the list is outdated, please download the most recent list from the link below. \r\nhttp://www1.nyc.gov/assets/tlc/downloads/datasets/tlc_medallion_drivers_active.csv\r\n\r\nThis is a list of drivers with a current TLC Driver License, which authorizes drivers to operate NYC TLC licensed yellow and green taxicabs and for-hire vehicles (FHVs). This list is accurate as of the date and time shown in the Last Date Updated and Last Time Updated fields. Questions about the contents of this dataset can be sent by email to: licensinginquiries@tlc.nyc.gov.", "topic": "Transportation", "ufd": "This dataset contains a list of active, licensed medallion taxi drivers in New York City. Each row represents a single driver and includes their license number, name, and the type of license they hold, which is consistently \"MEDALLION TAXI DRIVER\". The dataset also provides the expiration date of the driver's license. The `last_updated_date` and `last_updated_time` columns indicate when the dataset was last refreshed, ensuring the information is current. This dataset could be used to verify the credentials of taxi drivers or to analyze trends in the taxi industry. Note that the dataset is updated daily, so checking the 'Last Update Date' is important. The dataset includes 100 unique drivers.", "sfd": "Dataset Overview:\nThis dataset provides a comprehensive list of active, licensed medallion taxi drivers operating in New York City. Each record details a driver's license number, name, license type (consistently \"MEDALLION TAXI DRIVER\"), and license expiration date. The dataset is updated daily, with the `last_updated_date` and `last_updated_time` columns indicating the most recent refresh.\n\nRelated Topics:\n- Taxi Industry\n- Transportation Licensing\n- New York City\n- Driver Regulations\n- Medallion System\n\nConcepts and Synonyms:\n- Medallion Taxi Driver: Licensed taxi operator, cab driver, hack driver\n- License Expiration: Permit validity, license renewal date\n- Active License: Valid permit, current license\n- Last Updated Date: Data refresh date, most recent update\n\nApplications and Use Cases:\n- Verify the credentials of NYC taxi drivers.\n- Analyze trends in taxi driver licensing and demographics.\n- Track license expiration dates for compliance purposes.\n- Develop applications for taxi driver verification and information."}
{"dataset_id": "qgea-i56i", "title": "NYPD Complaint Data Historic", "original_description": "This dataset includes all valid felony, misdemeanor, and violation crimes reported to the New York City Police Department (NYPD) from 2006 to the end of last year (2019). For additional details, please see the attached data dictionary in the ‘About’ section.", "topic": "Public Safety", "ufd": "This dataset contains detailed information on complaints reported to the New York City Police Department (NYPD). Each row represents a single complaint, including the date and time the complaint was made (`cmplnt_fr_dt`, `cmplnt_fr_tm`, `cmplnt_to_dt`, `cmplnt_to_tm`), the type of offense (`ofns_desc`), and the location where it occurred (`boro_nm`, `addr_pct_cd`). The dataset also includes information about the victim (`vic_age_group`, `vic_race`, `vic_sex`) and any suspects (`susp_age_group`, `susp_race`, `susp_sex`). Researchers and public safety analysts can use this data to analyze crime patterns, identify trends in specific offenses, and understand the demographics of victims and suspects. The `law_cat_cd` column indicates whether the offense was a felony, misdemeanor, or violation. The precinct code (`addr_pct_cd`) can be used to map crime incidents to specific areas of the city.", "sfd": "Dataset Overview:\nThis dataset provides comprehensive details on complaints filed with the New York City Police Department (NYPD). It includes information on the date, time, offense type, location, and demographics of both victims and suspects involved in each complaint. The data allows for analysis of crime patterns, trends, and demographics related to reported incidents in New York City.\n\nRelated Topics:\n- Crime Statistics\n- Law Enforcement\n- Public Safety\n- New York City\n- Demographics\n- Incident Reporting\n\nConcepts and Synonyms:\n- Complaint: Incident, Report, Offense\n- Offense Description: Crime Type, Violation, Misdemeanor, Felony\n- Victim: Complainant, Injured Party\n- Suspect: Perpetrator, Accused\n- Location: Precinct, Borough, Address\n- Demographics: Age, Race, Sex\n\nApplications and Use Cases:\n- Analyze crime trends and patterns across different boroughs and precincts.\n- Identify high-crime areas and allocate resources accordingly.\n- Study the demographics of victims and suspects involved in different types of offenses.\n- Evaluate the effectiveness of crime prevention strategies.\n- Track changes in crime rates over time.\n- Develop predictive models for crime occurrence."}
{"dataset_id": "uvpi-gqnh", "title": "2015 Street Tree Census - Tree Data", "original_description": "Street tree data from the TreesCount! 2015 Street Tree Census, conducted by volunteers and staff organized by NYC Parks & Recreation and partner organizations. Tree data collected includes tree species, diameter and perception of health. Accompanying blockface data is available indicating status of data collection and data release citywide.\n\nThe 2015 tree census was the third decadal street tree census and largest citizen science initiative in NYC Parks’ history. Data collection ran from May 2015 to October 2016 and the results of the census show that there are 666,134 trees planted along NYC's streets. The data collected as part of the census represents a snapshot in time of trees under NYC Parks' jurisdiction.\n\nThe census data formed the basis of our operational database, the Forestry Management System (ForMS) which is used daily by our foresters and other staff for inventory and asset management: https://data.cityofnewyork.us/browse?sortBy=most_accessed&utf8=%E2%9C%93&Data-Collection_Data-Collection=Forestry+Management+System+%28ForMS%29\n\nTo learn more about the data collected and managed in ForMS, please refer to this user guide:\nhttps://docs.google.com/document/d/1PVPWFi-WExkG3rvnagQDoBbqfsGzxCKNmR6n678nUeU/edit. For information on the city's current tree population, use the ForMS datasets.", "topic": "Environment", "ufd": "This dataset contains information collected during the 2015 Street Tree Census in New York City. It provides a snapshot of the city's street trees, including their species (spc_common, spc_latin), health (health), and diameter (tree_dbh). The data also includes location information such as address, zipcode, borough (boroname), latitude, and longitude. Key columns like 'status' indicate whether a tree is alive, dead, or a stump, while 'problems' lists any issues observed, such as stones or wires. Researchers, urban planners, and environmental advocates can use this dataset to analyze tree distribution, assess tree health, and identify areas needing improved tree care. The 'created_at' column indicates when the tree data was recorded. This information can be valuable for understanding the urban forest and its impact on the city's environment.", "sfd": "Dataset Overview:\nThis dataset presents a comprehensive inventory of New York City's street trees, compiled during the 2015 Street Tree Census. It details tree species, health status, diameter, and location, including borough, address, and coordinates. The dataset also notes tree status (alive, dead, stump) and any observed problems, offering a detailed view of the urban forest.\n\nRelated Topics:\n- Urban Forestry\n- Environmental Monitoring\n- Urban Planning\n- Tree Health\n- Geographic Information Systems (GIS)\n- Biodiversity\n- Urban Ecology\n\nConcepts and Synonyms:\n- Street Trees: Urban trees, roadside trees, public trees\n- Tree Health: Tree condition, tree vitality, tree wellness\n- Species: Tree type, tree variety, spc_common, spc_latin\n- Borough: City district, area, boroname\n- Tree Diameter: DBH (Diameter at Breast Height), tree size\n- Location: Latitude, longitude, address, zipcode\n\nApplications and Use Cases:\n- Analyze tree distribution patterns across different boroughs.\n- Assess the overall health of the urban forest and identify areas with declining tree health.\n- Map tree species diversity and identify areas for planting new trees.\n- Investigate the relationship between tree health and environmental factors like air quality.\n- Develop urban planning strategies for improving tree care and expanding the urban forest.\n- Create visualizations and interactive maps of NYC's street trees.\n- Study the impact of street trees on property values and neighborhood aesthetics."}
{"dataset_id": "rbx6-tga4", "title": "DOB NOW: Build – Approved Permits", "original_description": "List of all approved construction permits in DOB NOW except for <a href=\"https://data.cityofnewyork.us/City-Government/DOB-NOW-Electrical-Permit-Applications/dm9a-ab7w\">Electrical</a>, <a href=\"https://data.cityofnewyork.us/Housing-Development/DOB-NOW-Build-Elevator-Permit-Applications/kfp4-dz4h\">Elevator</a>, and <a href=\"https://data.cityofnewyork.us/Housing-Development/DOB-NOW-Build-Limited-Alteration-Applications/xxbr-ypig\">Limited Alteration Application (LAA)</a> which have their own datasets.", "topic": "Housing & Development", "ufd": "This dataset contains information on approved construction permits in New York City, excluding electrical, elevator, and limited alteration applications, which have their own datasets. Each row represents a permit and includes details such as the job filing number, work permit number, and the reason for filing (initial or renewal). Location information is provided through the house number, street name, borough, lot, BIN (Building Identification Number), block, and NTA (Neighborhood Tabulation Area). The dataset also specifies the type of work being done (e.g., structural, plumbing) and the floor(s) where the work is taking place. Key personnel involved are identified by their license type and numbers, as well as their names and business information. Dates for approval, issuance, and expiration of the permits are included, along with the permit status (issued or signed-off). Researchers and city planners can use this data to analyze construction trends, track permit approvals, and understand the types of construction activities occurring in different neighborhoods.", "sfd": "Dataset Overview:\nThis dataset details approved construction permits in New York City, excluding specific permit types like electrical and elevator work. It provides comprehensive information on each permit, including location details, work type, key personnel involved, and permit status. This data is valuable for analyzing construction trends and understanding development activities across different NYC neighborhoods.\n\nRelated Topics:\n  - Construction\n  - Urban Planning\n  - Real Estate Development\n  - New York City\n  - Building Permits\n  - Housing\n  - Infrastructure\n\nConcepts and Synonyms:\n  - Construction Permits: Building Permits, Work Permits, Job Filings\n  - Location Data: House Number, Street Name, Borough, Lot, BIN (Building Identification Number), Block, NTA (Neighborhood Tabulation Area)\n  - Permit Status: Issued, Signed-off, Approved, Expired\n  - Work Type: Structural, Plumbing, Alteration, Renovation\n  - Key Personnel: Licensed Professionals, Contractors, Architects, Engineers\n  - NYC: New York City, City of New York\n\nApplications and Use Cases:\n  - Analyze construction trends across different boroughs and neighborhoods.\n  - Track permit approval rates and identify potential bottlenecks in the permitting process.\n  - Understand the types of construction activities occurring in specific areas (e.g., renovations vs. new construction).\n  - Identify key players in the construction industry (e.g., active contractors, architects).\n  - Evaluate the impact of zoning regulations on construction activity.\n  - Develop predictive models for future construction demand.\n  - Monitor permit expiration rates and potential compliance issues."}
{"dataset_id": "wvxf-dwi5", "title": "Housing Maintenance Code Violations", "original_description": "Pursuant to New York City’s Housing Maintenance Code, the Department of Housing Preservation and Development (HPD) issues violations against conditions, in rental dwelling units and buildings, that have been verified to violate the New York City Housing Maintenance Code (HMC) or the New York State Multiple Dwelling Law (MDL).\r\nEach row in this dataset contains discrete information about one violation of the New York City Housing Maintenance Code or New York State Multiple Dwelling Law. Each violation is identified using a unique Violation ID. These Laws are in place to provide requirements for the maintenance of residential dwelling units within New York City. \r\nViolations are issued by Housing Inspectors after a physical inspection is conducted (except for class I violations which are generally  administratively issued).  Violations are issued in four classes: Class A (non-hazardous), Class B (hazardous), Class C (immediately hazardous) and Class I (information orders).  For more information on violations, see https://www1.nyc.gov/site/hpd/owners/compliance-clear-violations.page  \r\nThe base data for this file is all violations open as of October 1, 2012.  Violation data is updated daily.  The daily update includes both new violations and updates to the status of previously issued violations. An open violation is a violation which is still active on the Department records. See the status table for determining how to filter for open violations versus closed violations, and within open violations for a more detailed current status. \r\nThe property owner may or may not have corrected the physical condition if the status is open. The violation status is closed when the violation is observed/verified as corrected by HPD or as certified by the landlord.   The processes for having violations dismissed are described at http://www1.nyc.gov/site/hpd/owners/compliance-clear-violations.page\r\nUsing other HPD datasets, such as the Building File or the Registration File, a user can link together violations issued for given buildings or for given owners.", "topic": "Housing & Development", "ufd": "This dataset contains records of housing maintenance code violations issued by the New York City Department of Housing Preservation and Development (HPD). Each row represents a single violation, identified by a unique `violationid`. The data includes details about the building where the violation occurred, such as `buildingid`, `boro`, `housenumber`, `streetname`, and `zip`. The `novdescription` column provides a description of the violation, while `inspectiondate` and `novissueddate` indicate when the inspection took place and the violation was issued. The current status of the violation (`currentstatus`) and its classification (`class`) are also included. Researchers, landlords, tenants, and city planners can use this dataset to analyze housing quality, identify areas with high violation rates, and track the resolution of housing maintenance issues. The `rentimpairing` column indicates if the violation affects the rent, which is useful for tenant advocacy and legal aid organizations.", "sfd": "Dataset Overview:\nThis dataset details housing maintenance code violations issued by the NYC HPD. Each record represents a single violation, including building information, violation descriptions, inspection and issuance dates, violation status, and classification. The data can be used to analyze housing quality, identify problem areas, and track violation resolution.\n\nRelated Topics:\n- Housing Quality\n- Code Enforcement\n- Property Management\n- Urban Planning\n- New York City\n- Building Inspections\n- Tenant Rights\n\nConcepts and Synonyms:\n- Housing Maintenance Code Violations: HPD violations, building code violations, housing code infractions\n- Building Information: building ID, address, property details\n- Violation Description: NOV description, violation details, problem description\n- Violation Status: current status, violation resolution, open violations, closed violations\n- Rent Impairing: rent affecting, tenant impact, habitability\n\nApplications and Use Cases:\n- Identify buildings with high violation rates.\n- Analyze trends in housing code violations over time.\n- Track the resolution of housing maintenance issues.\n- Assess the impact of violations on rent and tenant rights.\n- Support research on housing quality and urban development.\n- Inform policy decisions related to housing code enforcement.\n- Develop tools for tenants to report and track violations."}
{"dataset_id": "ic3t-wcy2", "title": "DOB Job Application Filings", "original_description": "This dataset contains all job applications submitted through the Borough Offices, through eFiling, or through the HUB, which have a \"Latest Action Date\" since January 1, 2000. This dataset does not include jobs submitted through DOB NOW. See the <a href=\"https://data.cityofnewyork.us/d/w9ak-ipjd\" target=\"_blank\" rel=\"noreferrer\"\n>DOB NOW: Build – Job Application Filings</a> dataset for DOB NOW jobs.", "topic": "Housing & Development", "ufd": "This dataset contains job application filings submitted to the New York City Department of Buildings (DOB). It provides details on building projects, including location information such as borough, house number, street name, block, and lot. Key columns include job type, job status, and descriptions of the work being done. The latest action date indicates when the most recent activity occurred on the application. Researchers, urban planners, and real estate professionals can use this dataset to analyze construction trends, track project progress, and gain insights into development activities across the city. The dataset also includes information about the applicant and property owner, as well as costs and fees associated with the job. Note that this dataset does not include jobs submitted through DOB NOW; see the linked dataset for those filings.", "sfd": "Dataset Overview:\nThis dataset contains job application filings submitted to the New York City Department of Buildings (DOB), excluding those submitted through DOB NOW. It includes detailed information on building projects across NYC, such as location, job type, status, work descriptions, and application dates. The data also covers applicant and property owner details, along with associated costs and fees.\n\nRelated Topics:\n  - Construction\n  - Urban Planning\n  - Real Estate\n  - New York City\n  - Building Permits\n  - Development\n  - Housing\n\nConcepts and Synonyms:\n  - Job Application Filing: Building permit application, construction permit, project filing\n  - DOB: Department of Buildings, NYC DOB\n  - Job Type: Construction type, project category, building work type\n  - Job Status: Application status, permit status, project stage\n  - Location Information: Borough, block, lot, address, property location\n  - Latest Action Date: Last updated, recent activity date, most recent filing date\n\nApplications and Use Cases:\n  - Analyze construction trends in NYC by borough and neighborhood.\n  - Track the progress of building projects based on job status and latest action date.\n  - Identify areas with high levels of development activity.\n  - Research the types of construction projects being undertaken.\n  - Investigate costs and fees associated with different types of building jobs.\n  - Study application patterns and processing times."}
{"dataset_id": "5ucz-vwe8", "title": "NYPD Shooting Incident Data (Year To Date)", "original_description": "List of every shooting incident that occurred in NYC  during the current calendar year.\r\n\r\nThis is a breakdown of every shooting incident that occurred in NYC during the current calendar year. This data is manually extracted every quarter and reviewed by the Office of Management Analysis and Planning before being posted on the NYPD website. \r\n Each record represents a shooting incident in NYC and includes information about the event, the location and time of occurrence. In addition, information related to suspect and victim demographics is also included. This data can be used by the public to explore the nature of police enforcement activity. Please refer to the attached data footnotes for additional information about this dataset.", "topic": "Public Safety", "ufd": "This dataset provides a detailed look at shooting incidents in New York City during the current calendar year. Each row represents a single shooting incident, offering insights into the location, time, and individuals involved. Key columns include `occur_date` and `occur_time` for when the incident happened, `boro` and `precinct` for location details, and `perp_age_group`, `perp_sex`, `perp_race`, `vic_age_group`, `vic_sex`, and `vic_race` for demographic information about perpetrators and victims. The `statistical_murder_flag` indicates whether the incident is classified as a murder. Researchers, policymakers, and the public can use this data to analyze trends in shooting incidents, understand the demographics of those affected, and inform strategies for improving public safety. The location descriptions provide further detail, classifying incidents by `loc_classfctn_desc` such as street or housing, and `location_desc` providing more specific details. The dataset also includes geographic coordinates (`latitude`, `longitude`) for mapping and spatial analysis.", "sfd": "Dataset Overview:\nThis dataset contains detailed information on shooting incidents in New York City for the current year. It includes specifics on the time and location of each incident, as well as demographic details of both perpetrators and victims. The data allows for analysis of shooting trends, affected populations, and spatial patterns related to gun violence in NYC.\n\nRelated Topics:\n- Crime Statistics\n- Gun Violence\n- Public Health\n- Demographics\n- New York City\n- Law Enforcement\n- Incident Reporting\n\nConcepts and Synonyms:\n- Shooting Incident: Gun violence, firearm assault, shooting event\n- Perpetrator: Assailant, offender, suspect, shooter\n- Victim: Injured party, casualty, target\n- Location: Precinct, borough, latitude, longitude, geographic coordinates\n- Demographics: Age, sex, race, population characteristics\n- Statistical Murder Flag: Homicide indicator, murder classification\n\nApplications and Use Cases:\n- Analyze trends in shooting incidents over time and by location.\n- Identify demographic patterns of victims and perpetrators.\n- Map shooting incidents to identify high-risk areas.\n- Inform public safety strategies and resource allocation.\n- Evaluate the effectiveness of crime prevention programs.\n- Research the relationship between socioeconomic factors and gun violence."}
{"dataset_id": "w9ak-ipjd", "title": "DOB NOW: Build – Job Application Filings", "original_description": "List of most job filings filed in DOB NOW. This dataset does not include certain types of job.  For Electrical jobs, use https://data.cityofnewyork.us/browse?Data-Collection_Data-Collection=DOB+NOW+Electrical+Permits+Data. Elevator and LAA jobs will also be published separately.", "topic": "Housing & Development", "ufd": "This dataset provides a detailed look into job application filings in New York City through the DOB NOW: Build system. It includes records of various construction and alteration projects, offering insights into the city's development landscape. Each entry contains a unique job filing number, the current filing status (e.g., \"Approved,\" \"Permit Entire,\" or \"LOC Issued\"), and the location of the project, including house number, street name, and borough. You can also find information on the type of work being done, such as plumbing or sprinkler work, the initial cost of the project, and whether the project complies with NYC energy conservation codes. The dataset further details the involved parties, such as the applicant's professional title and license number, and the filing representative's information. Researchers, urban planners, and real estate professionals can use this data to analyze construction trends, track project approvals, and assess compliance with building codes across different boroughs. The community board and lot number are also included, offering more granular location data.", "sfd": "Dataset Overview:\nThis dataset contains records of job application filings in New York City via the DOB NOW: Build system. It provides detailed information on construction and alteration projects, including filing status, project location, work type, and involved parties. The data offers insights into NYC's development landscape, construction trends, and building code compliance.\n\nRelated Topics:\n- Construction Permits\n- Building Permits\n- Urban Planning\n- Real Estate Development\n- New York City\n- Building Codes\n- Job Filings\n- DOB NOW: Build\n\nConcepts and Synonyms:\n- Job Filing Number: Application ID, Project Number\n- Filing Status: Application Status, Permit Status (e.g., Approved, Permit Entire, LOC Issued)\n- Project Location: Address, House Number, Street Name, Borough, Community Board, Lot Number\n- Work Type: Plumbing, Sprinkler, Construction, Alteration\n- Initial Cost: Estimated Cost, Project Cost\n- Energy Code Compliance: Energy Conservation Code, ECC Compliance\n- Applicant Professional Title: Architect, Engineer, Contractor\n- Filing Representative: Applicant Representative\n\nApplications and Use Cases:\n- Analyze construction trends and project approval rates across different boroughs.\n- Track project progress and identify potential delays based on filing status.\n- Assess compliance with NYC energy conservation codes.\n- Identify areas with high construction activity for real estate investment.\n- Study the relationship between project cost and work type.\n- Map construction projects based on location data (house number, street name, borough).\n- Investigate the distribution of different types of construction work across the city.\n- Evaluate the effectiveness of the DOB NOW: Build system."}
{"dataset_id": "ebb7-mvp5", "title": "DSNY Monthly Tonnage Data", "original_description": "DSNY Monthly Tonnage Data provides monthly collection tonnages that the Department of Sanitation collects from NYC residences and institutions. For more information about DSNY collection services, see: https://www.nyc.gov/site/dsny/collection/residents.page.", "topic": "City Government", "ufd": "This dataset provides monthly data on the tons of waste collected by the New York City Department of Sanitation (DSNY) from residences and institutions. The data is broken down by borough and community district, offering a geographical perspective on waste management. Key columns include the month of collection, the borough, the community district, and the tons collected for different waste types: refuse, paper, metal/glass/plastic (MGP), residential organics, school organics, and other organics. The `borough_id` column provides a numerical identifier for each borough. This dataset can be used to analyze waste collection patterns across different areas of New York City, track trends in waste generation and recycling, and evaluate the effectiveness of waste management programs. Researchers, city planners, and environmental advocates can leverage this information to inform policy decisions, optimize resource allocation, and promote sustainable waste management practices.", "sfd": "Dataset Overview:\nThis dataset contains monthly waste collection data from the New York City Department of Sanitation (DSNY), broken down by borough and community district. It includes the tons of various waste types collected, such as refuse, paper, and recyclables. The data offers a geographical and temporal perspective on waste management in NYC.\n\nRelated Topics:\n- Waste Management\n- Recycling\n- Environmental Science\n- Urban Planning\n- New York City\n- Sanitation\n- Government Data\n- Public Health\n\nConcepts and Synonyms:\n- Waste Collection: Garbage Collection, Refuse Removal, Trash Pickup\n- Borough: County, District, Region\n- Community District: Neighborhood, Local Area, Sub-Borough\n- Tons: Weight, Volume, Mass\n- Refuse: Garbage, Trash, Solid Waste\n- Paper: Cardboard, Recyclables, Fiber\n- Metal/Glass/Plastic (MGP): Recyclables, Bottles, Cans\n- Organics: Compost, Food Waste, Yard Waste\n- DSNY: Department of Sanitation, NYC Sanitation\n\nApplications and Use Cases:\n- Analyze waste generation trends across different boroughs.\n- Evaluate the effectiveness of recycling programs.\n- Identify areas with high waste generation for targeted interventions.\n- Track the impact of new waste management policies.\n- Predict future waste collection needs.\n- Compare waste collection efficiency across community districts.\n- Develop data-driven waste reduction strategies."}
{"dataset_id": "uip8-fykc", "title": "NYPD Arrest Data (Year to Date)", "original_description": "This is a breakdown of every arrest effected in NYC by the NYPD during the current year.\n This data is manually extracted every quarter and reviewed by the Office of Management Analysis and Planning. \n Each record represents an arrest effected in NYC by the NYPD and includes information about the type of crime, the location and time of enforcement. \nIn addition, information related to suspect demographics is also included. \nThis data can be used by the public to explore the nature of police enforcement activity. \nPlease refer to the attached data footnotes for additional information about this dataset.", "topic": "Public Safety", "ufd": "This dataset provides a detailed look at arrests made by the NYPD in New York City. Each row represents a single arrest and includes information such as the date of the arrest (`arrest_date`), the type of offense (`ofns_desc` and `pd_desc`), and the relevant legal codes (`law_code` and `law_cat_cd`). The dataset also contains demographic information about the person arrested, including their age group (`age_group`), sex (`perp_sex`), and race (`perp_race`). Location information is provided through borough (`arrest_boro`) and precinct (`arrest_precinct`). Researchers, policymakers, and the public can use this data to analyze crime patterns, understand law enforcement activities, and explore demographic trends related to arrests in NYC. The `arrest_key` column serves as a unique identifier for each arrest record. Additional geographic regions are also included, though their specific definitions are not provided.", "sfd": "Dataset Overview:\nThis dataset contains detailed records of arrests made by the NYPD in New York City. Each record includes information about the arrest date, offense type, legal codes, and demographic characteristics of the arrested individual. Location information, including borough and precinct, is also provided, enabling analysis of arrest patterns across the city.\n\nRelated Topics:\n- Crime statistics\n- Law enforcement\n- Demographics\n- New York City\n- Public safety\n- Criminal justice\n- Policing\n\nConcepts and Synonyms:\n- Arrest: Apprehension, custody, detainment\n- Offense: Crime, violation, infraction\n- Demographic: Age, sex, race, ethnicity\n- Precinct: Police district, local station\n- NYPD: New York Police Department\n- Law Code: Legal statute, penal code\n- Borough: NYC borough (e.g., Manhattan, Brooklyn, Queens)\n\nApplications and Use Cases:\n- Analyze crime trends and patterns in NYC.\n- Study the demographic characteristics of individuals arrested.\n- Evaluate the effectiveness of law enforcement strategies.\n- Investigate potential biases in arrest practices.\n- Track changes in arrest rates over time.\n- Map crime hotspots and identify areas with high arrest activity.\n- Support research on criminal justice reform."}
{"dataset_id": "5uac-w243", "title": "NYPD Complaint Data Current (Year To Date)", "original_description": "This dataset includes all valid felony, misdemeanor, and violation crimes reported to the New York City Police Department (NYPD) for all complete quarters so far this year (2019). For additional details, please see the attached data dictionary in the ‘About’ section.", "topic": "Public Safety", "ufd": "This dataset contains information about complaints reported to the New York City Police Department (NYPD). Each row represents a single complaint and includes details about the incident. Key columns include `cmplnt_num` for the complaint number, `cmplnt_fr_dt` and `cmplnt_fr_tm` for the date and time the complaint was made, and `ofns_desc` for the offense description. The dataset also provides location information such as `boro_nm` for the borough and `addr_pct_cd` for the police precinct. Information about the suspect and victim, such as age group, race, and sex, are also included. Researchers and analysts can use this dataset to study crime patterns, identify high-crime areas, and analyze demographic trends related to crime in New York City. The data can also be used to improve public safety strategies and resource allocation.", "sfd": "Dataset Overview:\nThis dataset details complaints filed with the New York City Police Department (NYPD). Each record represents a single complaint and includes information about the date, time, offense, location, and demographics of involved parties. The data spans various boroughs and police precincts within New York City.\n\nRelated Topics:\n- Crime Statistics\n- Law Enforcement\n- New York City\n- Public Health\n- Demographics\n- Incident Reporting\n\nConcepts and Synonyms:\n- Complaint: Incident Report, Police Report, Crime Report\n- Offense Description: Crime Type, Violation, Misdemeanor, Felony\n- Borough: County, District, Region\n- Precinct: Police District, Police Station Area\n- Suspect: Perpetrator, Offender, Accused\n- Victim: Complainant, Injured Party\n\nApplications and Use Cases:\n- Analyze crime trends and patterns across different boroughs and precincts.\n- Identify high-crime areas and allocate resources accordingly.\n- Study demographic trends related to crime, such as age, race, and sex of suspects and victims.\n- Evaluate the effectiveness of public safety strategies and interventions.\n- Develop predictive models to forecast future crime incidents.\n- Investigate the relationship between crime and socioeconomic factors."}
{"dataset_id": "c3uy-2p5r", "title": "Air Quality", "original_description": "Dataset contains information on New York City air quality surveillance data.\r\n\r\nAir pollution is one of the most important environmental threats to urban populations and while all people are exposed, pollutant emissions, levels of exposure, and population vulnerability vary across neighborhoods. Exposures to common air pollutants have been linked to respiratory and cardiovascular diseases, cancers, and premature deaths. These indicators provide a perspective across time and NYC geographies to better characterize air quality and health in NYC. Data can also be explored online at the Environment and Health Data Portal: http://nyc.gov/health/environmentdata.", "topic": "Environment", "ufd": "This dataset provides air quality surveillance data for New York City, focusing on the summer of 2023. It includes measurements of pollutants like Nitrogen dioxide (NO2), Fine particles (PM 2.5), and Ozone (O3). The `data_value` column represents the mean concentration of these pollutants, measured in parts per billion (ppb) or micrograms per cubic meter (mcg/m3), as indicated by the `measure_info` column. Data is categorized by geographic areas, specified by `geo_type_name` (e.g., CD for Community District, UHF for United Hospital Fund district) and `geo_place_name`, allowing users to analyze air quality variations across different neighborhoods. The `geo_join_id` can be used to link this data with other datasets containing geographic information. Researchers and policymakers can use this dataset to assess air quality levels, identify pollution hotspots, and track changes over time to inform public health interventions. The dataset's temporal focus is on the \"Summer 2023\" time period, with a `start_date` of June 1, 2023.", "sfd": "Dataset Overview:\nThis dataset contains air quality surveillance data for New York City during the summer of 2023. It includes measurements of pollutants such as Nitrogen dioxide (NO2), Fine particles (PM 2.5), and Ozone (O3), categorized by geographic areas within the city. The data allows for analysis of air quality variations across different neighborhoods and can be linked with other geographic datasets.\n\nRelated Topics:\n- Air Quality\n- Environmental Monitoring\n- Pollution\n- Public Health\n- Geographic Data\n- New York City\n- Climate Change\n\nConcepts and Synonyms:\n- Air Quality: Air Pollution, Atmospheric Quality, Air Purity\n- Pollutants: Contaminants, Emissions, Particulates, NO2, PM2.5, Ozone (O3)\n- Geographic Area: Location, Region, Neighborhood, Community District (CD), United Hospital Fund district (UHF)\n- Concentration: Level, Amount, Measurement, Data Value (ppb, mcg/m3)\n- Surveillance: Monitoring, Observation, Tracking\n\nApplications and Use Cases:\n- Identify pollution hotspots within New York City.\n- Analyze the spatial distribution of air pollutants.\n- Assess the impact of air quality on public health.\n- Track changes in air quality over time.\n- Inform public health interventions and policy decisions.\n- Link air quality data with other datasets containing geographic information.\n- Create visualizations of air quality data for public awareness."}
{"dataset_id": "7479-ugqb", "title": "Daily Inmates In Custody", "original_description": "Daily inmates in custody with attributes (custody level, mental health designation, race, gender, age, leagal status, sealed status, security risk group membership, top charge,  and infraction flag). This data set excludes Sealed Cases. Resulting summaries may differ slightly from other published statistics.", "topic": "Public Safety", "ufd": "This dataset provides information on daily inmates in custody, offering insights into the characteristics of the incarcerated population. Key details include the inmate's custody level (MAX, MED, MIN), mental health designation (BRADH), race, gender, and age. The dataset also tracks the inmate's legal status via an inmate status code, security risk group membership (SRG_FLG), top charge, and whether they have had any infractions. Notably, sealed cases are excluded from this dataset. Researchers and public safety analysts can use this data to analyze trends in incarceration, assess the demographics of inmates, and understand factors related to custody level and infractions. The `admitted_dt` column indicates when an inmate was admitted.", "sfd": "Dataset Overview:\nThis dataset contains daily information on inmates in custody, excluding sealed cases. It includes details on custody level, mental health designation, race, gender, age, legal status, security risk group membership, top charge, and infractions. The dataset also provides the date an inmate was admitted.\n\nRelated Topics:\n- Incarceration Rates\n- Criminal Justice\n- Prison Demographics\n- Custody Levels\n- Mental Health in Prisons\n- Recidivism\n- Public Safety Statistics\n\nConcepts and Synonyms:\n- Inmate: Prisoner, Offender, Detainee\n- Custody Level: Security Level, Risk Classification (MAX, MED, MIN)\n- Mental Health Designation: BRADH (Behavioral Risk Assessment and Designation Housing), Mental Health Status\n- Inmate Status Code: Legal Status, Offender Status\n- Security Risk Group (SRG): Gang Affiliation, Threat Group\n- Infraction: Violation, Disciplinary Action, Rule Breaking\n- Admitted Date: Incarceration Date, Entry Date\n\nApplications and Use Cases:\n- Analyzing trends in incarceration rates based on demographics.\n- Assessing the prevalence of mental health issues within the incarcerated population.\n- Identifying factors associated with different custody levels.\n- Studying the relationship between security risk group membership and infractions.\n- Evaluating the impact of age, race, and gender on incarceration patterns.\n- Developing predictive models for recidivism.\n- Informing public safety policies and resource allocation."}
{"dataset_id": "kpav-sd4t", "title": "Jobs NYC Postings", "original_description": "This dataset contains current job postings available on the  City of New York’s official jobs site (http://www.nyc.gov/html/careers/html/search/search.shtml).  Internal postings available to city employees and external postings available to the general public are included.", "topic": "City Government", "ufd": "This dataset provides a comprehensive overview of job opportunities within New York City government agencies. It includes both internal and external job postings, offering insights into a wide range of positions. Key columns include 'agency' indicating the hiring department, 'business_title' and 'civil_service_title' specifying the job title, 'job_category' grouping positions by function, and 'salary_range_from' and 'salary_range_to' outlining the compensation scale. The dataset also details the 'posting_type' (internal or external), 'number_of_positions' available, 'full_time_part_time_indicator', and 'career_level'. Users can leverage this data to explore career paths within NYC government, analyze salary trends across different agencies and job categories, or identify required qualifications and preferred skills for specific roles. The 'job_description' column provides detailed information about responsibilities, while 'minimum_qual_requirements' outlines the necessary qualifications.", "sfd": "Dataset Overview:\nThis dataset contains information on job postings within New York City government agencies, encompassing both internal and external opportunities. It provides details on job titles, agencies, salary ranges, and required qualifications. The data allows for analysis of career paths, salary trends, and job requirements within the NYC government sector.\n\nRelated Topics:\n- Government Jobs\n- Public Sector Employment\n- Municipal Government\n- Human Resources\n- City of New York\n- Civil Service\n\nConcepts and Synonyms:\n- Job Postings: Open positions, job vacancies, employment opportunities\n- Agency: Department, bureau, division, office\n- Salary Range: Compensation, pay scale, wage range\n- Job Category: Occupation, profession, field, specialization\n- Minimum Qualifications: Requirements, prerequisites, eligibility criteria\n- Civil Service Title: Official job title, government job classification\n\nApplications and Use Cases:\n- Analyze salary disparities across different agencies and job categories.\n- Identify high-demand job categories within NYC government.\n- Explore career progression paths within specific agencies.\n- Determine the most common minimum qualifications for government jobs.\n- Compare internal vs. external job posting characteristics.\n- Build a tool to search and filter NYC government job openings.\n- Analyze the skills and experience described in job descriptions."}
{"dataset_id": "9nt8-h7nd", "title": "2020 Neighborhood Tabulation Areas (NTAs)", "original_description": "2020 Neighborhood Tabulation Areas (NTAs) are medium-sized statistical geographies for reporting Decennial Census and American Community Survey (ACS). 2020 NTAs are created by aggregating 2020 census tracts and nest within Community District Tabulation Areas (CDTA). NTAs were delineated with the need for both geographic specificity and statistical reliability in mind. Consequently, each NTA contains enough population to mitigate sampling error associated with the ACS yet offers a unit of analysis that is smaller than a Community District.\n\nThough NTA boundaries and their associated names roughly correspond with many neighborhoods commonly recognized by New Yorkers, NTAs are not intended to definitively represent neighborhoods, nor are they intended to be exhaustive of all possible names and understandings of neighborhoods throughout New York City. Additionally, non-residential areas including large parks, airports, cemeteries, and other special areas are represented separately within this dataset and are assigned codes according to their type (See NTAType field).\n\nAll previously released versions of this data are available on the <a href=\"https://www.nyc.gov/content/planning/pages/resources/datasets/neighborhood-tabulation\">DCP Website: BYTES of the BIG APPLE</a>. Current version: 25c", "topic": "City Government", "ufd": "This dataset provides geographic boundaries and attributes for the 2020 Neighborhood Tabulation Areas (NTAs) in New York City. NTAs are statistical geographies used for reporting data from the Decennial Census and American Community Survey. Key columns include `boroname` and `ntaname`, specifying the borough and neighborhood name, respectively, and `countyfips`, a unique identifier. The `the_geom` column contains the geospatial data defining the boundaries of each NTA. Researchers, city planners, and analysts can use this dataset to visualize neighborhood-level data, perform spatial analysis, and understand demographic patterns across New York City. The dataset also includes Community District Tabulation Areas (CDTA) information, allowing for comparisons between NTAs and larger community districts.", "sfd": "Dataset Overview:\nThis dataset contains geographic boundaries and attributes for the 2020 Neighborhood Tabulation Areas (NTAs) in New York City. NTAs are statistical geographies used for reporting data from the Decennial Census and American Community Survey. The dataset includes borough and neighborhood names, unique identifiers, and geospatial data defining NTA boundaries. This allows for neighborhood-level analysis and visualization of demographic patterns across New York City.\n\nRelated Topics:\n  - Urban Planning\n  - Demographics\n  - Geographic Information Systems (GIS)\n  - Census Data\n  - New York City\n  - Spatial Analysis\n\nConcepts and Synonyms:\n  - Neighborhood Tabulation Areas (NTAs)\n  - Community District Tabulation Areas (CDTAs)\n  - Geospatial Data\n  - Borough (boroname)\n  - Neighborhood Name (ntaname)\n  - County FIPS Code (countyfips)\n  - Geographic Boundaries\n  - Census Tracts\n  - Spatial Units\n\nApplications and Use Cases:\n  - Visualize neighborhood-level data in New York City.\n  - Perform spatial analysis of demographic patterns.\n  - Compare data between NTAs and Community Districts.\n  - Integrate with other datasets containing demographic or socioeconomic information.\n  - Support urban planning and policy development.\n  - Analyze the distribution of resources and services across neighborhoods."}
{"dataset_id": "eabe-havv", "title": "DOB Complaints Received", "original_description": "This is the universe of complaints received by Department of Buildings (DOB). It includes complaints that come from 311 or that are entered into the system by DOB staff.\r\n\r\nA Complaint Categories codes can be found at\r\nhttp://www1.nyc.gov/assets/buildings/pdf/bis_complaint_disposition_codes.pdf", "topic": "Housing & Development", "ufd": "This dataset contains records of complaints received by the New York City Department of Buildings (DOB), including those submitted through 311 or entered directly by DOB staff. Each row represents a single complaint, identified by a unique complaint number. The data includes the status of the complaint (e.g., \"CLOSED\" or \"ACTIVE\"), the date it was entered, and the address of the property in question, including house number, street, zip code, and community board. The dataset also categorizes the complaint type and provides a unit identifier, as well as disposition and inspection dates and codes. Researchers and city planners can use this data to analyze trends in building-related complaints, identify areas with high complaint volumes, and assess the effectiveness of DOB's complaint resolution process. The `complaint_category` column provides insights into the types of issues being reported, while the `status` and disposition-related columns offer information on how complaints are handled. The `zip_code` and `community_board` columns can be used to spatially analyze complaint patterns across the city.", "sfd": "Dataset Overview:\nThis dataset details building-related complaints received by the New York City Department of Buildings (DOB), including those reported via 311. Each record represents a single complaint and includes information on its status, address, complaint type, and resolution details. The data allows for analysis of complaint trends, identification of problem areas, and evaluation of the DOB's response to complaints.\n\nRelated Topics:\n- Building Code Violations\n- Urban Planning\n- City Services\n- 311 Data\n- Property Management\n- Housing Quality\n- Regulatory Compliance\n\nConcepts and Synonyms:\n- DOB Complaints: Department of Buildings Complaints, Building Violations, Construction Complaints\n- Complaint Status: Case Status, Resolution Status, Active Complaints, Closed Complaints\n- Complaint Category: Violation Type, Issue Type, Problem Description\n- Address Information: Property Address, Location Data, House Number, Street Name, Zip Code, Community Board\n- Disposition: Resolution, Outcome, Action Taken, Inspection Result\n\nApplications and Use Cases:\n- Analyze trends in building complaints across different neighborhoods.\n- Identify properties with recurring violations.\n- Evaluate the effectiveness of DOB's complaint resolution process.\n- Predict future complaint hotspots based on historical data.\n- Improve resource allocation for building inspections.\n- Provide insights for urban planning and development initiatives."}
{"dataset_id": "nzjr-3966", "title": "NYC Civil Service Titles", "original_description": "This is a list of NYC civil service title codes and  descriptions used by City of New York agencies as well as if the title requires investigation before appointment.", "topic": "City Government", "ufd": "This dataset provides a comprehensive list of civil service job titles within New York City government. It includes details such as the title code, job description, standard working hours, and assignment level. A key feature of the dataset is its detailed information on union affiliation, including the union code, a description of the union, the bargaining unit, and a more detailed description of the bargaining unit. Salary ranges are also provided, with both minimum and maximum rates for each position. Finally, the dataset indicates whether an investigation is required before an appointment for each title. Researchers and job seekers can use this dataset to understand the landscape of city government jobs, explore salary expectations, and learn about union representation.", "sfd": "Dataset Overview:\nThis dataset catalogs civil service job titles within New York City government. It includes information on job descriptions, working hours, union affiliation, and salary ranges. The data also specifies whether an investigation is required prior to appointment for each title.\n\nRelated Topics:\n- Government Jobs\n- Public Sector Employment\n- Civil Service\n- Labor Unions\n- Salary Data\n- New York City\n\nConcepts and Synonyms:\n- Civil Service Titles: Job classifications, position names, job codes\n- Union Affiliation: Bargaining unit, union code, labor representation\n- Salary Range: Minimum rate, maximum rate, pay scale\n- Assignment Level: Job grade, responsibility level\n- Investigation Required: Background check, pre-employment screening\n\nApplications and Use Cases:\n- Analyzing salary disparities across different job titles and unions.\n- Identifying trends in civil service job requirements.\n- Comparing union representation across different city agencies.\n- Developing a tool for job seekers to explore career opportunities in NYC government.\n- Researching the impact of unionization on public sector wages."}
{"dataset_id": "7ym2-wayt", "title": "Automated Traffic Volume Counts", "original_description": "New York City Department of Transportation (NYC DOT) uses Automated Traffic Recorders (ATR) to collect traffic sample volume counts at bridge crossings and roadways.These counts do not cover the entire year, and the number of days counted per location may vary from year to year.", "topic": "Transportation", "ufd": "This dataset contains traffic volume counts collected by the New York City Department of Transportation (NYC DOT) using Automated Traffic Recorders (ATR) on roadways and bridge crossings. The data includes the borough (`boro`) where the recording took place, the year (`yr`), month (`m`), day (`d`), hour (`hh`), and minute (`mm`) of the recording. The `vol` column represents the traffic volume count at a specific location identified by `segmentid` and described by the street name (`street`), the starting street (`fromst`), and the ending street (`tost`). The location is further specified using WKT geometry (`wktgeom`). This data can be used to analyze traffic patterns, identify congestion points, and understand traffic flow in different areas of New York City. The direction of traffic is indicated in the `direction` column.", "sfd": "Dataset Overview:\nThis dataset provides detailed traffic volume counts collected by the NYC DOT using Automated Traffic Recorders. It includes hourly traffic volume (`vol`) data, location information (borough, street, segment ID, WKT geometry), and timestamps (year, month, day, hour, minute). The data covers roadways and bridge crossings in New York City and can be used for traffic analysis and congestion studies.\n\nRelated Topics:\n- Traffic Volume\n- Transportation Planning\n- Urban Mobility\n- Congestion Analysis\n- New York City\n- Automated Traffic Recorders\n- Roadway Monitoring\n\nConcepts and Synonyms:\n- Traffic Volume: Vehicle count, traffic flow, road traffic, vehicular traffic\n- Automated Traffic Recorder (ATR): Traffic counter, traffic sensor, road sensor\n- Segment ID: Road segment identifier, location ID\n- WKT Geometry: Spatial data, geographic coordinates, location data, GIS data\n- Congestion: Traffic jam, bottleneck, heavy traffic, traffic slowdown\n\nApplications and Use Cases:\n- Analyze traffic patterns and trends in New York City.\n- Identify areas with high traffic congestion.\n- Develop traffic management strategies and optimize traffic flow.\n- Evaluate the impact of infrastructure projects on traffic volume.\n- Create visualizations and maps of traffic data.\n- Predict future traffic volume based on historical data.\n- Support transportation planning and policy decisions."}
{"dataset_id": "6z8x-wfk4", "title": "Evictions", "original_description": "This dataset lists executed evictions within the five boroughs for the years 2017-Present (data prior to January 1, 2017, is not available). The data fields may be sorted by 20 categories of information including Court Index Number, Docket Number, Eviction Address, Marshal First or Last Name, Borough, etc.. \n \nEviction data is compiled from New York City Marshals. City Marshals are independent public officials appointed by the Mayor. Marshals can be contacted directly regarding evictions, and their contact information can be found at https://www1.nyc.gov/site/doi/offices/marshals-list.page.", "topic": "City Government", "ufd": "This dataset provides a record of executed evictions in New York City's five boroughs from 2017 to the present. Compiled from New York City Marshals, the data includes details such as the court index number, docket number, and eviction address. You can identify whether the eviction was for a residential or commercial property and the borough and zip code where it occurred. The dataset also contains the names of the Marshals who carried out the eviction. Location data, including latitude, longitude, community board, council district, and census tract, are available for most evictions. This information can be used to analyze eviction patterns across the city, understand the demographics of affected areas, and assess the impact of housing policies.", "sfd": "Dataset Overview:\nThis dataset contains records of executed evictions in New York City from 2017 to the present, sourced from NYC Marshals. It includes details like court case numbers, property type (residential/commercial), eviction address, and the Marshal responsible. Location data, including latitude/longitude and political districts, is also provided for most records.\n\nRelated Topics:\n- Housing\n- Eviction\n- New York City\n- Urban Planning\n- Legal Data\n- Real Estate\n- Demographics\n- Public Policy\n\nConcepts and Synonyms:\n- Eviction: Dispossession, Removal, Tenant Removal, Forced Move-out\n- NYC Marshals: City Marshals, Law Enforcement, Court Officers\n- Docket Number: Case Number, Index Number, Court Identifier\n- Residential: Housing, Apartment, Home\n- Commercial: Business, Retail, Office Space\n- Borough: County, District, Region (e.g., Manhattan, Brooklyn)\n- Location Data: Geolocation, Coordinates, Latitude, Longitude, Address\n\nApplications and Use Cases:\n- Analyze eviction rates by borough and zip code.\n- Identify trends in residential vs. commercial evictions.\n- Map eviction hotspots and correlate them with demographic data.\n- Evaluate the impact of housing policies on eviction rates.\n- Study the geographic distribution of evictions over time.\n- Research the effectiveness of different eviction prevention programs.\n- Provide insights for community organizations and legal aid services."}
{"dataset_id": "w7w3-xahh", "title": "Issued Licenses", "original_description": "This dataset features licenses issued by the NYC Department of Consumer and Worker Protection (DCWP)—formerly the Department of Consumer Affairs (DCA).", "topic": "Business", "ufd": "This dataset provides a comprehensive view of licenses issued by the NYC Department of Consumer and Worker Protection (DCWP), offering insights into the diverse range of businesses operating in New York City. Each record details specific licenses, including the license number, business name, unique identifier, and business category, such as \"Sightseeing Guide\" or \"Secondhand Dealer.\" The dataset also specifies the license type (Individual or Premises) and its current status (Active, Expired, etc.). Key date fields include the license creation and expiration dates, enabling users to track licensing timelines. Address information, including city, state, and zip code, allows for geographic analysis of licensed businesses. Researchers, entrepreneurs, and city planners can leverage this data to understand business trends, identify licensing needs, and analyze the geographic distribution of various business types across the city. The inclusion of contact phone numbers, where available, can facilitate direct engagement with licensed businesses.", "sfd": "Dataset Overview:\nThis dataset contains detailed information on licenses issued by the NYC Department of Consumer and Worker Protection (DCWP). It includes license details such as license number, business name, category, type (Individual or Premises), and status. The data also provides key dates (creation and expiration) and address information for licensed businesses in New York City.\n\nRelated Topics:\n- Business Licenses\n- NYC Government Data\n- Consumer Protection\n- Business Regulations\n- Geographic Business Analysis\n- Economic Development\n\nConcepts and Synonyms:\n- Business License: Permit, Authorization, Credential, Certification\n- DCWP: Department of Consumer and Worker Protection, NYC Consumer Affairs\n- License Status: Active, Expired, Revoked, Inactive\n- Business Category: Industry, Sector, Type of Business, SIC Code\n- Premises License: Location-Based License, Business Address\n- Individual License: Personal License, Professional License\n\nApplications and Use Cases:\n- Analyze the distribution of different business types across NYC boroughs.\n- Identify trends in license applications and renewals over time.\n- Investigate the impact of specific regulations on business licensing.\n- Develop targeted outreach programs for businesses in specific categories.\n- Verify the licensing status of a business.\n- Create a directory of licensed businesses in NYC.\n- Predict future licensing needs based on historical data."}
{"dataset_id": "9rz4-mjek", "title": "Tax Lien Sale Lists", "original_description": "Properties with tax and/or water liens that are potentially eligible to be included in the next lien sale.</p>Tax Lien Sale Lists : Properties with tax, water liens and other charges  that are potentially eligible to be included in the next lien sale plus tax liens which were eventually sold.", "topic": "City Government", "ufd": "This dataset contains a list of properties in New York City that are potentially eligible for inclusion in an upcoming tax lien sale. It includes properties with outstanding tax and/or water liens. The data provides details such as the borough, block, and lot number for each property, along with its tax class code and building class. Key columns include 'borough', 'block', 'lot', 'street_name', and 'zip_code', which together pinpoint the location of the property. The 'water_debt_only' column indicates whether the lien is solely due to water debt. This dataset could be used by real estate investors to identify potential investment opportunities, or by city officials to manage and track properties with outstanding debts. The 'cycle' column indicates the stage of notification, such as a \"90 Day Notice\".", "sfd": "**Dataset Overview:**\nThis dataset details properties in New York City that are candidates for a tax lien sale due to outstanding tax and/or water liens. It provides property-specific information like borough, block, lot, street name, and zip code, along with details on tax and building classifications. A key indicator is whether the lien is solely due to water debt.\n\n**Related Topics:**\n- Real Estate\n- Property Tax\n- Municipal Finance\n- Urban Planning\n- Debt Management\n- New York City Government\n\n**Concepts and Synonyms:**\n- Tax Lien Sale: Tax Foreclosure, Property Tax Auction\n- Property: Real Estate, Parcel, Lot\n- Borough: County (in NYC context), District\n- Block and Lot: Property Identification Number, Tax Lot\n- Water Debt: Water Bill Arrears, Unpaid Water Charges\n- Tax Class: Property Tax Classification, Land Use Code\n- Building Class: Building Type, Construction Category\n- Lien: Encumbrance, Claim, Debt\n\n**Applications and Use Cases:**\n- Identifying potential real estate investment opportunities in NYC.\n- Analyzing geographic concentrations of properties with tax liens.\n- Predicting the likelihood of properties entering tax lien sales.\n- Assisting city officials in managing and tracking properties with outstanding debts.\n- Evaluating the impact of water debt on property tax delinquency.\n- Understanding the distribution of different property and building classes subject to tax liens."}
{"dataset_id": "4b4i-vvec", "title": "2023 Yellow Taxi Trip Data", "original_description": "These records are generated from the trip record submissions made by yellow taxi Technology Service Providers (TSPs). Each row represents a single trip in a yellow taxi. The trip records include fields capturing pick-up and drop-off dates/times, pick-up and drop-off taxi zone locations, trip distances, itemized fares, rate types, payment types, and driver-reported passenger counts.", "topic": "Transportation", "ufd": "This dataset contains trip records from yellow taxis in 2023. Each row represents a single taxi trip, including details about pick-up and drop-off times and locations. You can identify the taxi company using the `vendorid`, and pinpoint the start and end of the journey with `tpep_pickup_datetime` and `tpep_dropoff_datetime`. The `pulocationid` and `dolocationid` columns specify the pickup and drop-off zones. Key information such as `trip_distance`, `fare_amount`, `tip_amount`, and `total_amount` are also included, providing a comprehensive overview of the trip cost. Researchers and analysts can use this data to study taxi usage patterns, analyze fare structures, or investigate the impact of congestion on trip costs. The `passenger_count` column allows for analysis of ridership, while `payment_type` indicates payment preferences.", "sfd": "Dataset Overview:\nThis dataset provides detailed trip information for yellow taxis in 2023. It includes pickup and drop-off locations and times, fare details, payment types, and passenger counts for each trip. The data allows for analysis of taxi usage patterns, fare structures, and ridership trends.\n\nRelated Topics:\n- Taxi trips\n- Transportation data\n- Fare analysis\n- Ridership analysis\n- Geographic data\n- Urban mobility\n\nConcepts and Synonyms:\n- Trip details: ride information, journey data\n- Pickup location: origin, start point, pulocationid\n- Drop-off location: destination, end point, dolocationid\n- Fare amount: trip cost, price, total_amount\n- Payment type: method of payment, payment options\n\nApplications and Use Cases:\n- Analyze taxi ridership patterns and trends.\n- Study the impact of location and time on taxi fares.\n- Investigate the relationship between trip distance and fare amount.\n- Develop predictive models for taxi demand.\n- Optimize taxi dispatch and routing strategies."}
{"dataset_id": "pe54-wf39", "title": "TLC Approved LabCorp Patient Services Drug Test Locations", "original_description": "List of TLC approved LabCorp Drug Test Locations. For inquiries about the contents of this dataset, please email tlccompliance@tlc.nyc.gov", "topic": "Transportation", "ufd": "This dataset contains a list of TLC-approved LabCorp patient service locations for drug testing. Each entry includes the address, city, state, and postcode of the location. Landmarks provide additional context for the location. The dataset also includes geographic information such as borough name, community board, council district, and census tract, offering insights into the location's surroundings. You can use this dataset to find nearby drug test locations or analyze the distribution of these facilities across different areas. The data is current as of October 8, 2025. Contact tlccompliance@tlc.nyc.gov for inquiries.", "sfd": "Dataset Overview:\nThis dataset provides a comprehensive list of TLC-approved LabCorp patient service locations used for drug testing. Each entry includes detailed address information, geographic identifiers, and landmark descriptions. The data allows users to identify nearby testing facilities and analyze their distribution across various geographic regions within New York City.\n\nRelated Topics:\n- Drug Testing Locations\n- Transportation Compliance\n- LabCorp Facilities\n- Geographic Data Analysis\n- New York City\n\nConcepts and Synonyms:\n- TLC (Taxi and Limousine Commission)\n- LabCorp Patient Service Locations\n- Drug Testing Sites\n- Address: Street address, city, state, postcode\n- Geographic Identifiers: Borough, Community Board, Council District, Census Tract\n- Landmarks: Points of interest, nearby buildings\n\nApplications and Use Cases:\n- Finding nearby drug testing locations for TLC drivers.\n- Analyzing the geographic distribution of drug testing facilities in NYC.\n- Identifying areas with limited access to drug testing services.\n- Supporting transportation compliance efforts by providing location data.\n- Mapping and visualizing drug testing facility locations."}
{"dataset_id": "64uk-42ks", "title": "Primary Land Use Tax Lot Output (PLUTO)", "original_description": "Extensive land use and geographic data at the tax lot level in comma-separated values (CSV) file format. The PLUTO files contain more than seventy fields derived from data maintained by city agencies.\n\nAll previously released versions of this data are available on the <a href=\"https://www.nyc.gov/content/planning/pages/resources/datasets/mappluto-pluto-change\">DCP Website: BYTES of the BIG APPLE</a>. Current version: 25v3", "topic": "City Government", "ufd": "This dataset, known as PLUTO (Primary Land Use Tax Lot Output), provides detailed land use and geographic information for tax lots in New York City. It includes over 70 fields derived from various city agencies, offering a comprehensive view of properties. Key columns include 'borough', 'block', and 'lot' to uniquely identify properties, along with location information like 'zipcode', 'policeprct', and 'healtharea'. The dataset also contains details on building characteristics such as 'yearbuilt', 'numfloors', 'bldgarea', and land use codes. Researchers, city planners, and real estate professionals can use this data to analyze land use patterns, assess property values, and understand the built environment in NYC. The data can also be used to identify properties within specific school districts ('schooldist') or council districts ('council'). This dataset is updated to version 25v3 and previous versions are available on the DCP website.", "sfd": "Dataset Overview:\nThe PLUTO dataset offers comprehensive land use and geographic details for tax lots across New York City. It encompasses over 70 fields sourced from various city agencies, providing a detailed profile of individual properties. This dataset is essential for understanding urban development, property characteristics, and land use patterns within NYC.\n\nRelated Topics:\n- Urban Planning\n- Real Estate\n- Property Assessment\n- Geographic Information Systems (GIS)\n- New York City\n- Land Use\n- Tax Lots\n- City Government\n\nConcepts and Synonyms:\n- PLUTO: Primary Land Use Tax Lot Output\n- Tax Lot: Property Parcel, Land Parcel\n- Borough: NYC Borough (e.g., Manhattan, Brooklyn, Queens)\n- Block and Lot: Unique property identifier\n- Land Use Codes: Zoning designations, property type classifications\n- Building Characteristics: Building attributes, property features (e.g., year built, number of floors, building area)\n- Geographic Information: Location data, spatial attributes (e.g., zipcode, police precinct, health area)\n\nApplications and Use Cases:\n- Analyzing land use patterns and trends in NYC.\n- Assessing property values and identifying investment opportunities.\n- Supporting urban planning and development initiatives.\n- Mapping and visualizing property characteristics across the city.\n- Identifying properties within specific school or council districts.\n- Studying the impact of zoning regulations on building development.\n- Creating real estate market analyses."}
{"dataset_id": "vfnx-vebw", "title": "2018 Central Park Squirrel Census - Squirrel Data", "original_description": "The Squirrel Census (https://www.thesquirrelcensus.com/) is a multimedia science, design, and storytelling project focusing on the Eastern gray (Sciurus carolinensis). They count squirrels and present their findings to the public. This table contains squirrel data for each of the 3,023 sightings, including location coordinates, age, primary and secondary fur color, elevation, activities, communications, and interactions between squirrels and with humans.", "topic": "Environment", "ufd": "This dataset contains information on squirrel sightings in Central Park during 2018, collected by The Squirrel Census. Each row represents a unique squirrel sighting, identified by a unique squirrel ID. Key details include the location of the sighting (x, y coordinates and hectare), the time of day (shift), and the date. The dataset also provides information about the squirrel's physical characteristics, such as primary and highlight fur color, and age. Furthermore, the dataset captures the squirrel's behavior, including activities like running, chasing, climbing, eating, and foraging, as well as interactions with other squirrels or humans. Researchers or park enthusiasts can use this data to analyze squirrel behavior patterns, population density in different areas of the park, or the impact of human activity on squirrel behavior.", "sfd": "Dataset Overview:\nThis dataset details squirrel sightings in Central Park throughout 2018, recorded by The Squirrel Census. It includes location data (coordinates, hectare), time of day, date, and unique squirrel IDs for each sighting. The dataset also features information on squirrel characteristics (fur color, age) and observed behaviors (running, eating, interacting).\n\nRelated Topics:\n  - Urban Wildlife\n  - Animal Behavior\n  - Ecology\n  - Park Management\n  - Citizen Science\n\nConcepts and Synonyms:\n  - Squirrel Sightings: Squirrel Observations, Squirrel Encounters\n  - Central Park: NYC Park, Manhattan Park\n  - Fur Color: Coat Color, Pelage\n  - Squirrel Behavior: Animal Activity, Foraging, Interaction\n  - Location Data: Coordinates, Spatial Data, Geographic Location\n\nApplications and Use Cases:\n  - Analyze squirrel population density across different park areas.\n  - Study the correlation between human activity and squirrel behavior.\n  - Map squirrel activity patterns based on time of day and location.\n  - Investigate the prevalence of different fur colors within the squirrel population.\n  - Model squirrel foraging behavior in relation to available food sources."}
{"dataset_id": "833y-fsy8", "title": "NYPD Shooting Incident Data (Historic)", "original_description": "List of every shooting incident that occurred in NYC going back to 2006 through the end of the previous calendar year.\n\nThis is a breakdown of every shooting incident that occurred in NYC going back to 2006 through the end of the previous calendar year. This data is manually extracted every quarter and reviewed by the Office of Management Analysis and Planning before being posted on the NYPD website. Each record represents a shooting incident in NYC and includes information about the event, the location and time of occurrence. In addition, information related to suspect and victim demographics is also included. This data can be used by the public to explore the nature of shooting/criminal activity. Please refer to the attached data footnotes for additional information about this dataset.", "topic": "Public Safety", "ufd": "This dataset provides a detailed record of shooting incidents in New York City, dating back to 2006. Each entry represents a single incident and includes the date and time it occurred, the borough and specific location, and whether it was classified as a statistical murder. Information on the individuals involved, such as age group, sex, and race of both perpetrators and victims, is also included where available. The dataset also includes geographic coordinates (latitude and longitude) for mapping and spatial analysis. Researchers, policymakers, and the public can use this data to analyze trends in shooting incidents, understand demographic patterns, and inform public safety strategies. The incident_key serves as a unique identifier for each event, while occur_date and occur_time pinpoint when the incident took place.", "sfd": "Dataset Overview:\nThis dataset contains records of shooting incidents in New York City from 2006 to the present. It includes details on the location, date, time, and demographics of victims and perpetrators involved in each incident. The data also indicates whether the incident was classified as a statistical murder and provides geographic coordinates for spatial analysis.\n\nRelated Topics:\n- Crime statistics\n- Law enforcement\n- Public health\n- Urban planning\n- Demographics\n- New York City\n\nConcepts and Synonyms:\n- Shooting incident: Gun violence, firearm assault, shooting event\n- Perpetrator: Offender, suspect, attacker\n- Victim: Injured party, casualty, target\n- Statistical murder: Homicide, fatal shooting\n- Borough: NYC borough (e.g., Manhattan, Brooklyn, Queens)\n- Geographic coordinates: Latitude, longitude, geospatial data\n\nApplications and Use Cases:\n- Analyze trends in shooting incidents over time.\n- Identify high-risk areas and demographic groups.\n- Evaluate the effectiveness of public safety interventions.\n- Create interactive maps of shooting incidents.\n- Research the relationship between socioeconomic factors and gun violence.\n- Inform community-based violence prevention programs."}
{"dataset_id": "enfh-gkve", "title": "Parks Properties", "original_description": "This dataset identifies property managed partially or solely by NYC Parks. This data has been produced in whole or part using secondary data. Data accuracy is limited by the scale and accuracy of the original sources. Site-specific conditions should be field-verified. \n\nRecords are added as more land is designated under NYC Parks’ jurisdiction. Each record represents an acquisition. \n\nUser Guide: https://docs.google.com/document/d/1NExNJF5YKID04oOopi0fHainRuGG3Pz_jKSrMujPsPk/edit?usp=sharing\n\nData Dictionary: https://docs.google.com/spreadsheets/d/1Q4DBWu7riNFxWvy1vnTJHoOI3r2L9oW6eCN56jCNyCw/edit?usp=sharing", "topic": "Recreation", "ufd": "This dataset provides information about properties managed by NYC Parks, including parks, playgrounds, and gardens. Each record represents an acquisition of land by NYC Parks. Key columns include the acquisition date, the size of the property in acres, the address, and the borough in which it is located. The dataset also includes community board and council district information. You can use this dataset to explore the distribution of park properties across the city, analyze the size and location of different types of recreational spaces, or identify properties within specific political districts. The data also includes a multipolygon column with coordinate information for mapping.", "sfd": "Dataset Overview:\nThis dataset details land acquisitions by NYC Parks, encompassing parks, playgrounds, and gardens. It includes information on acquisition dates, property sizes in acres, addresses, and borough locations. The dataset also provides community board and council district details, along with a multipolygon column for mapping property boundaries.\n\nRelated Topics:\n- Parks and Recreation\n- Land Management\n- Urban Planning\n- New York City\n- Geographic Information Systems (GIS)\n\nConcepts and Synonyms:\n- NYC Parks Properties: Parks, Playgrounds, Gardens, Recreational Areas\n- Land Acquisition: Property Purchase, Real Estate Acquisition, Land Procurement\n- Borough: Manhattan, Brooklyn, Queens, Bronx, Staten Island\n- Political Districts: Community Board, Council District\n- Property Size: Acreage, Land Area\n\nApplications and Use Cases:\n- Analyze the spatial distribution of park properties across NYC boroughs.\n- Determine the average size of park properties acquired in different time periods.\n- Identify park properties located within specific community boards or council districts.\n- Map park property boundaries using the multipolygon column.\n- Investigate the relationship between park property size and location."}
{"dataset_id": "3h2n-5cm9", "title": "DOB Violations", "original_description": "This data set includes older civil penalties (commonly referred to as ‘DOB Violations’) that were issued by the Department of Buildings (DOB) in the Buildings Information System (BIS).  For newer civil penalties, see the <a href=\"https://data.cityofnewyork.us/d/855j-jady\">DOB Safety Violations </a> data set (note: some violations are duplicated in both data sets).  Separately, summonses that are issued by DOB but adjudicated by OATH/ECB are in the  <a href=\"https://data.cityofnewyork.us/d/6bgk-3dad\">DOB ECB Violations</a> data set.", "topic": "Housing & Development", "ufd": "This dataset contains information on older civil penalties (DOB Violations) issued by the Department of Buildings (DOB). Each row represents a specific violation, identified by a unique `isn_dob_bis_viol` number. Key details include the `boro` (borough), `block`, and `lot` where the violation occurred, along with the `issue_date` and `violation_type_code`. The `violation_number`, `house_number`, and `street` provide further location context. The `disposition_comments` and `disposition_date` offer insights into the resolution of the violation. Researchers and city planners can use this data to analyze historical violation patterns, identify areas with frequent violations, and assess the effectiveness of past enforcement efforts. Note that some violations may be duplicated in both this dataset and the DOB Safety Violations dataset.", "sfd": "Dataset Overview:\nThis dataset details older civil penalties (DOB Violations) issued by the NYC Department of Buildings (DOB). Each record represents a specific violation, identified by a unique `isn_dob_bis_viol` number, and includes information on the location, date, and type of violation. The dataset also provides details on the disposition of the violation, including comments and the resolution date.\n\nRelated Topics:\n- NYC Department of Buildings (DOB)\n- Civil Penalties\n- Housing Violations\n- Building Code Enforcement\n- Property Management\n- Urban Planning\n- Real Estate\n\nConcepts and Synonyms:\n- DOB Violations: Building violations, Department of Buildings violations, civil penalties, fines\n- Disposition: Resolution, outcome, status, settlement\n- Boro: Borough, NYC borough (e.g., Manhattan, Brooklyn, Queens, Bronx, Staten Island)\n- Block and Lot: Property identification, tax lot, parcel number\n- Issue Date: Violation date, date of violation, date issued\n\nApplications and Use Cases:\n- Analyze historical trends in building code violations across different boroughs.\n- Identify properties or areas with a high frequency of violations.\n- Evaluate the effectiveness of past enforcement efforts by examining disposition outcomes.\n- Develop predictive models to forecast future violation hotspots.\n- Inform urban planning and resource allocation strategies for building code enforcement."}
{"dataset_id": "pvqr-7yc4", "title": "Parking Violations Issued - Fiscal Year 2024", "original_description": "This dataset provides data on Parking Violations Issued between July 1, 2023 to June 30, 2024.  In New York City, the fiscal year begins on July 1st of one calendar year and ends on June 30th of the following calendar year.  <a target=\"_blank\" href=\"https://www.nyc.gov/site/omb/faq/frequently-asked-questions.page#:~:text=our%20Careers%20page.-,The%20Expense%20Budget,-What%20is%20the\">Click here</a> to find out more about the NYC Fiscal Year.\r\n<br>Parking Violations Issuance datasets contain violations issued during the respective fiscal year. The Issuance datasets are not updated to reflect violation status, the information only represents the violation(s) at the time they are issued. Since appearing on an issuance dataset, a violation may have been paid, dismissed via a hearing, statutorily expired, or had other changes to its status. To see the current status of outstanding parking violations, please look at the <a target=\"_blank\" href=\"https://data.cityofnewyork.us/City-Government/Open-Parking-and-Camera-Violations/nc67-uf89\">Open Parking & Camera Violations</a> dataset.\r\n<br>You may find all of the Parking Violations Issued since fiscal year 2014 in this <a target=\"_blank\" href=\"https://data.cityofnewyork.us/browse?Data-Collection_Data-Collection=DOF+Parking+Violations+Issued&q=&sortBy=alpha&utf8=%E2%9C%93\">dataset collection</a>.", "topic": "City Government", "ufd": "This dataset contains information on parking violations issued in New York City during fiscal year 2024 (July 1, 2023 to June 30, 2024). Each row represents a single parking ticket. Key details include the `summons_number` (a unique identifier for the ticket), the `plate_id` and `registration_state` of the vehicle, the `issue_date` and `violation_time`, and the `violation_code` explaining the reason for the ticket. The `street_name` and related street code columns provide location information. You can use this data to analyze parking violation patterns, identify areas with high violation rates, or study the types of vehicles that receive the most tickets. Keep in mind that this dataset only reflects the status of the violation at the time it was issued and does not include updates on payments or dismissals.", "sfd": "Dataset Overview:\nThis dataset details parking violations issued in New York City during fiscal year 2024 (July 1, 2023 to June 30, 2024). Each record represents a single parking ticket, including information on the vehicle, violation details, and location. The data can be used to analyze parking violation trends and patterns within the city.\n\nRelated Topics:\n  - New York City\n  - Parking Regulations\n  - Traffic Violations\n  - Municipal Government\n  - Law Enforcement\n  - Vehicle Registration\n\nConcepts and Synonyms:\n  - Parking Ticket: Summons, Notice of Violation, Citation\n  - Violation Code: Offense Code, Parking Rule\n  - Issue Date: Violation Date, Date of Offense\n  - Plate ID: License Plate Number, Vehicle Identification\n  - Street Name: Location, Intersection\n\nApplications and Use Cases:\n  - Analyze parking violation hotspots within NYC.\n  - Identify common parking violations.\n  - Study the relationship between vehicle registration state and violation frequency.\n  - Develop predictive models for parking violation occurrences.\n  - Evaluate the effectiveness of parking enforcement strategies."}
{"dataset_id": "xywu-7bv9", "title": "New York City Population by Borough, 1950 - 2040", "original_description": "Unadjusted decennial census data from 1950-2000 and projected figures from 2010-2040: summary table of New York City population numbers and percentage share by Borough, including school-age (5 to 17), 65 and Over, and total population.", "topic": "City Government", "ufd": "This dataset provides a detailed look at the population of New York City and its boroughs from 1950 to 2040. It includes both historical census data (1950-2000) and projected figures (2010-2040). The key columns include the borough name, population counts for each decade, and the borough's percentage share of the total NYC population. The 'age_group' column specifies the demographic being counted, such as the total population. This dataset could be used to analyze population trends in NYC, understand the changing demographics of each borough, and inform policy decisions related to resource allocation and urban planning. Researchers, city planners, and policymakers can use this data to gain insights into the past, present, and future population distribution across the city. The projections allow for proactive planning to accommodate future population shifts.", "sfd": "Dataset Overview:\nThis dataset contains historical and projected population data for New York City and its boroughs from 1950 to 2040. It includes population counts by borough and decade, along with each borough's percentage of the total NYC population. The data is categorized by age group, allowing for analysis of specific demographic trends.\n\nRelated Topics:\n- Demographics\n- Urban Planning\n- Census Data\n- Population Projections\n- New York City\n- Borough Statistics\n- Government Data\n- Social Sciences\n\nConcepts and Synonyms:\n- Population: Number of inhabitants, residents, populace\n- Borough: District, division, area (e.g., Manhattan, Brooklyn, Queens, Bronx, Staten Island)\n- Decade: Ten-year period\n- Projection: Forecast, estimate, prediction\n- Census: Population count, enumeration, demographic survey\n- Age Group: Demographic cohort, age bracket, population segment\n- Percentage Share: Proportion, fraction, relative amount\n\nApplications and Use Cases:\n- Analyze population growth and decline in different NYC boroughs.\n- Project future infrastructure needs based on population forecasts.\n- Understand demographic shifts and their impact on city services.\n- Compare historical population trends with current projections.\n- Inform policy decisions related to housing, education, and healthcare.\n- Allocate resources based on borough population distribution.\n- Research the impact of migration and urbanization on NYC."}
{"dataset_id": "jb7j-dtam", "title": "New York City Leading Causes of Death", "original_description": "The leading causes of death by sex and ethnicity in New York City in since 2007. Cause of death is derived from the NYC death certificate which is issued for every death that occurs in New York City.\n\n</p>\nReport last ran: 09/24/2019</br>\nRates based on small numbers (RSE > 30) as well as aggregate counts less than 5 have been suppressed in downloaded data</p>\nSource: Bureau of Vital Statistics and  New York City Department of Health and Mental Hygiene", "topic": "Health", "ufd": "This dataset provides insights into the leading causes of death in New York City for the year 2021. It breaks down mortality data by sex and race/ethnicity, offering a detailed view of health trends within the city. Key columns include \"leading_cause,\" which specifies the primary reason for death, \"deaths,\" representing the number of deaths attributed to that cause, and \"death_rate\" and \"age_adjusted_death_rate,\" which provide mortality rates. Researchers and public health officials can use this data to identify prevalent health issues, understand disparities in mortality rates across different demographic groups, and inform public health interventions. The dataset also includes the \"year,\" \"sex,\" and \"race_ethnicity\" columns for filtering and analyzing specific population segments. Understanding these trends can help allocate resources effectively and develop targeted prevention strategies.", "sfd": "Dataset Overview:\nThis dataset details the leading causes of death in New York City during 2021. It provides a breakdown of mortality statistics by sex and race/ethnicity. Key metrics include the number of deaths, death rate, and age-adjusted death rate for each leading cause.\n\nRelated Topics:\n- Public Health\n- Mortality Rates\n- Epidemiology\n- Demographics\n- Health Disparities\n- New York City\n- Cause of Death\n\nConcepts and Synonyms:\n- Leading Cause: Primary cause of death, main reason for mortality\n- Death Rate: Mortality rate, deaths per population\n- Age-Adjusted Death Rate: Standardized mortality rate, rate adjusted for age distribution\n- Race/Ethnicity: Demographic group, population segment\n- Mortality: Death, fatality\n- NYC: New York City\n\nApplications and Use Cases:\n- Identify leading causes of death in NYC.\n- Analyze mortality rate disparities across different racial and ethnic groups.\n- Track trends in death rates over time (if multiple years are available in similar datasets).\n- Inform public health policy and resource allocation.\n- Develop targeted interventions to reduce mortality from specific causes.\n- Research the impact of social determinants of health on mortality."}
{"dataset_id": "btm5-ppia", "title": "Traffic Volume Counts", "original_description": "New York City Department of Transportation (NYC DOT) uses Automated Traffic Recorders (ATR) to collect traffic sample volume counts at bridge crossings and roadways. These counts do not cover the entire year, and the number of days counted per location may vary from year to year.\nAlso see Automated Traffic Volume Counts: https://data.cityofnewyork.us/Transportation/Automated-Traffic-Volume-Counts/7ym2-wayt", "topic": "Transportation", "ufd": "This dataset contains traffic volume counts collected by the New York City Department of Transportation (NYC DOT) using Automated Traffic Recorders (ATR) at various bridge crossings and roadways. The data includes the `roadway_name`, the `from` and `to` locations defining the segment, and the `direction` of travel. Traffic volume is recorded hourly, from `_12_00_1_00_am` to `_11_00_12_00am`, along with the `date` of the recording. The `segmentid` column provides a unique identifier for each road segment. This dataset can be used to analyze traffic patterns, identify peak hours, and understand traffic flow on different roadways in New York City. Note that data is only available for a limited number of days per location and may vary from year to year. Researchers, urban planners, and transportation engineers can leverage this data for traffic management, infrastructure planning, and transportation modeling.", "sfd": "Dataset Overview:\nThis dataset provides hourly traffic volume counts collected by the NYC DOT at various bridge crossings and roadways. The data includes roadway name, segment location (from/to), direction of travel, and the date of the recording. The dataset can be used to analyze traffic patterns, identify peak hours, and understand traffic flow on different roadways in New York City.\n\nRelated Topics:\n- Traffic Volume\n- Transportation Planning\n- Urban Planning\n- New York City\n- Roadway Analysis\n- Traffic Management\n\nConcepts and Synonyms:\n- Traffic Volume: Traffic Count, Vehicle Count, Flow Rate\n- Roadway Segment: Road Section, Street Segment, Highway Section\n- Peak Hours: Rush Hour, Congestion Times, High Traffic Periods\n- Automated Traffic Recorder (ATR): Traffic Counter, Roadside Sensor\n- Direction of Travel: Traffic Direction, Travel Lane, Flow Direction\n\nApplications and Use Cases:\n- Analyze traffic patterns and identify peak hours on specific roadways.\n- Develop traffic management strategies to reduce congestion.\n- Support urban planning and infrastructure development projects.\n- Model traffic flow and predict future traffic conditions.\n- Evaluate the impact of roadway improvements on traffic volume."}
{"dataset_id": "5zyy-y8am", "title": "NYC Building Energy and Water Data Disclosure for Local Law 84 (2022-Present)", "original_description": "Local Law 84 of 2009 (LL84) requires annual energy and water benchmarking data to be submitted by owners of buildings with more than 50,000 square feet. This data is collected via the Environmental Protection Agency's (EPA) <a href=\"https://www.energystar.gov/buildings/tools-and-resources/portfolio-manager-0\">Portfolio Manager website</a>\r\n\r\nEach property is identified by it's EPA assigned property ID, and can contain one or more tax lots identified by one or more BBLs (Borough, Block, Lot) or one or more buildings identified by one or more building identification numbers (BIN)\r\n\r\nPlease visit <a href=\"https://www1.nyc.gov/site/buildings/codes/benchmarking.page\">DOB's Benchmarking and Energy Efficiency Rating page</a>\r\n for additional information.", "topic": "Environment", "ufd": "This dataset contains energy and water consumption data for buildings in New York City, collected to comply with Local Law 84. The data includes property details such as name, address, and primary property type, along with energy-related information like energy star score, site energy use, and greenhouse gas emissions. Water usage data is also provided. The `report_year` column indicates the year the data was reported, while `property_id` uniquely identifies each property. Researchers and policymakers can use this data to analyze building energy performance, track progress towards sustainability goals, and identify opportunities for energy efficiency improvements. The dataset also includes location information like city and postal code for spatial analysis.", "sfd": "Dataset Overview:\nThis dataset provides energy and water consumption data for buildings in New York City, as reported under Local Law 84. It includes building characteristics, energy usage metrics (like energy star score and site energy use), greenhouse gas emissions, and water consumption. The data is organized by property and reporting year, enabling analysis of building performance and sustainability efforts.\n\nRelated Topics:\n  - Energy Consumption\n  - Water Consumption\n  - Building Performance\n  - Sustainability\n  - Urban Planning\n  - Environmental Regulations\n  - Greenhouse Gas Emissions\n  - New York City\n\nConcepts and Synonyms:\n  - Energy Star Score\n  - Site Energy Use (EUI)\n  - Greenhouse Gas (GHG) Emissions\n  - Water Usage\n  - Local Law 84 (LL84)\n  - Building Energy Performance\n  - Property ID\n  - Reporting Year\n  - Energy Efficiency\n\nApplications and Use Cases:\n  - Analyze building energy performance trends in NYC.\n  - Identify buildings with high energy consumption for targeted interventions.\n  - Track progress towards NYC's sustainability goals.\n  - Develop predictive models for energy consumption based on building characteristics.\n  - Evaluate the impact of energy efficiency programs.\n  - Compare energy and water usage across different property types.\n  - Conduct spatial analysis of energy consumption patterns."}
{"dataset_id": "hg8x-zxpr", "title": "Affordable Housing Production by Building", "original_description": "The Department of Housing Preservation and Development (HPD) reports on projects, buildings, and units that began after January 1, 2014, and are counted towards either the Housing New York plan (1/1/2014 – 12/31/2021) or the Housing Our Neighbors: A Blueprint for Housing & Homelessness plan (1/1/2022 – present).", "topic": "Housing & Development", "ufd": "This dataset provides details on affordable housing projects in New York City, specifically those contributing to the Housing New York and Housing Our Neighbors plans since 2014. Each row represents a building within a project, identified by a unique `building_id` and associated with a `project_id` and `project_name`. Key information includes the `project_start_date`, the building's address components (`house_number`, `street_name`, `borough`, `postcode`), and its location within administrative areas like `community_board` and `council_district`. The dataset also breaks down the number of units by income level (`extremely_low_income_units`, `very_low_income_units`, `low_income_units`) and bedroom count (`_1_br_units`, `_2_br_units`, etc.), along with the total number of affordable units (`total_units`). Researchers, city planners, and housing advocates can use this data to analyze affordable housing production trends, assess the distribution of affordable units across different boroughs and income levels, and evaluate the impact of housing policies. Information on construction type (`reporting_construction_type`), affordability status (`extended_affordability_status`), and prevailing wage status (`prevailing_wage_status`) offers further insights into the nature and quality of these projects.", "sfd": "Dataset Overview:\nThis dataset details affordable housing projects in New York City since 2014, focusing on initiatives like Housing New York and Housing Our Neighbors. It provides building-level information, including address, unit counts by income and bedroom size, project details, and administrative area identifiers. The data allows for analysis of affordable housing production, distribution, and policy impact.\n\nRelated Topics:\n- Affordable Housing\n- Housing Policy\n- Urban Development\n- New York City\n- Real Estate\n- Income Inequality\n- Community Planning\n\nConcepts and Synonyms:\n- Affordable Housing: Subsidized Housing, Low-Income Housing, Workforce Housing\n- Housing New York: De Blasio Housing Plan, Affordable Housing Plan\n- Unit Count: Number of Apartments, Housing Units, Dwelling Units\n- Income Level: Low Income, Very Low Income, Extremely Low Income, AMI (Area Median Income)\n- Borough: Manhattan, Brooklyn, Queens, Bronx, Staten Island\n- Project: Development, Building, Construction Project\n\nApplications and Use Cases:\n- Analyze the geographic distribution of affordable housing units across NYC boroughs.\n- Evaluate the effectiveness of Housing New York and Housing Our Neighbors plans.\n- Identify trends in the production of affordable units by income level and bedroom count.\n- Assess the impact of prevailing wage requirements on affordable housing development.\n- Map affordable housing projects and overlay them with demographic data to identify areas of need.\n- Track the progress of affordable housing projects over time.\n- Compare the characteristics of affordable housing projects built under different construction types."}
{"dataset_id": "6bgk-3dad", "title": "DOB ECB Violations", "original_description": "This data set includes summonses issued by the Department of Buildings that are adjudicated by OATH/ECB. Separately, civil penalties (commonly referred to as ‘DOB Violations’) are found in the <a href=\"https://data.cityofnewyork.us/d/855j-jady\">DOB Safety Violations </a> (for newer issuances) and <a href=\"https://data.cityofnewyork.us/d/3h2n-5cm9\">DOB Violations </a>  (for older issuances) data sets.", "topic": "Housing & Development", "ufd": "This dataset contains information on summonses issued by the New York City Department of Buildings (DOB) and adjudicated by the Office of Administrative Trials and Hearings (OATH)/Environmental Control Board (ECB). Each row represents a single violation, identified by a unique ECB violation number. Key details include the Building Identification Number (BIN), borough, block, and lot where the violation occurred, as well as the date and time of the hearing. The dataset also specifies the type and severity of the violation, the penalty imposed, the amount paid, and any balance due. You can use this data to analyze trends in building code violations across different boroughs, assess the effectiveness of enforcement efforts, or identify properties with repeated violations. The `ecb_violation_status` column indicates the current status of the violation, while `hearing_status` details the outcome of the hearing.", "sfd": "Dataset Overview:\nThis dataset provides detailed information on summonses issued by the NYC Department of Buildings (DOB) and adjudicated by the OATH/ECB. It includes violation details such as location (BIN, borough, block, lot), violation type and severity, hearing outcomes, and financial penalties. The data can be used to analyze building code violations and enforcement patterns across New York City.\n\nRelated Topics:\n- Building Code Violations\n- NYC Department of Buildings (DOB)\n- Office of Administrative Trials and Hearings (OATH)\n- Environmental Control Board (ECB)\n- Housing Enforcement\n- Property Management\n- Urban Development\n- Real Estate Compliance\n\nConcepts and Synonyms:\n- ECB Violation: Environmental Control Board violation, DOB summons, building code infraction, notice of violation (NOV)\n- BIN: Building Identification Number, property ID\n- Hearing Status: Adjudication outcome, violation disposition, ruling\n- Violation Type: Offense category, code violated, infraction description\n- Penalty: Fine amount, assessed fee, monetary sanction\n- Borough: NYC borough, e.g., Manhattan, Brooklyn, Queens, Bronx, Staten Island\n\nApplications and Use Cases:\n- Analyze trends in building code violations by borough, building type, or violation type.\n- Identify properties with repeated violations or outstanding penalties.\n- Evaluate the effectiveness of DOB enforcement efforts.\n- Predict future violations based on historical data.\n- Assess the financial impact of building code violations on property owners.\n- Develop tools for property owners to proactively address potential violations.\n- Research the relationship between building code violations and other factors, such as property values or demographics."}
{"dataset_id": "76xm-jjuj", "title": "EMS Incident Dispatch Data", "original_description": "The EMS Incident Dispatch Data file contains data that is generated by the EMS Computer Aided Dispatch System. The data spans from the time the incident is created in the system to the time the incident is closed in the system.  It covers information about the incident as it relates to the assignment of resources and the Fire Department’s response to the emergency. To protect personal identifying information in accordance with the Health Insurance Portability and Accountability Act (HIPAA), specific locations of incidents are not included and have been aggregated to a higher level of detail.", "topic": "Public Safety", "ufd": "This dataset contains information about EMS incident dispatches, from the initial call to the closing of the incident. It includes details on the type of call (e.g., injury, drug-related), the severity level, and timestamps for various stages of the response, such as when the incident was first assigned, when responders arrived on the scene, and when the patient arrived at the hospital. The dataset also provides information on the location of the incident, including the borough, dispatch area, and zip code. Key columns include `incident_datetime`, `initial_call_type`, `final_call_type`, `dispatch_response_seconds_qy` (dispatch response time in seconds), and geographic information. Researchers and public safety analysts can use this data to analyze response times, identify trends in incident types, and assess resource allocation across different areas. The `held_indicator` and `reopen_indicator` columns can be used to understand incident management processes. Please note that to protect personal information, specific locations have been aggregated.", "sfd": "Dataset Overview:\nThis dataset details EMS incident dispatches, encompassing the entire incident lifecycle from initial call to closure. It includes information on call types, severity levels, timestamps for response stages (dispatch, arrival, hospital arrival), and location details (borough, dispatch area, zip code). The data allows for analysis of response times, incident trends, and resource allocation.\n\nRelated Topics:\n- Emergency Medical Services (EMS)\n- Public Health\n- Incident Response\n- Geographic Analysis\n- Resource Allocation\n- Urban Planning\n- Public Safety\n- Dispatch Operations\n\nConcepts and Synonyms:\n- EMS Incident: Emergency Medical Service Event, 911 Call, Medical Emergency\n- Dispatch Response Time: Response Time, Time to Dispatch, Time to Scene\n- Initial Call Type: Complaint Type, Nature of Call, Reason for Dispatch\n- Final Call Type: Incident Outcome, Resolution Type, Disposition\n- Geographic Location: Incident Location, Borough, Dispatch Area, Zip Code\n- Severity Level: Priority, Urgency, Call Classification\n\nApplications and Use Cases:\n- Analyze EMS response times across different boroughs and zip codes.\n- Identify trends in specific incident types (e.g., drug-related incidents) over time.\n- Evaluate the impact of resource allocation on response times and patient outcomes.\n- Develop predictive models for forecasting EMS demand in different areas.\n- Optimize dispatch protocols to improve efficiency and reduce response times.\n- Study the relationship between socioeconomic factors and EMS incident rates.\n- Assess the effectiveness of public health interventions on reducing specific types of emergencies."}
{"dataset_id": "pri4-ifjk", "title": "Modified Zip Code Tabulation Areas (MODZCTA)", "original_description": "A shapefile for mapping data by Modified Zip Code Tabulation Areas (MODZCTA) in NYC, based on the 2010 Census ZCTA shapefile. MODZCTA are being used by the NYC Department of Health & Mental Hygiene (DOHMH) for mapping COVID-19 Data.", "topic": "Health", "ufd": "This dataset provides geographic boundaries for Modified Zip Code Tabulation Areas (MODZCTA) in New York City. MODZCTAs are a custom geographic aggregation of zip codes used by the NYC Department of Health & Mental Hygiene (DOHMH) for mapping health-related data, particularly for COVID-19 analysis. The dataset includes the MODZCTA code, a label, the corresponding 2010 Census ZCTA(s), and a population estimate. The `the_geom` column contains the geospatial data defining the boundaries of each MODZCTA. Researchers and public health officials can use this dataset to visualize and analyze health data at the MODZCTA level, identify areas with specific health needs, and inform public health interventions. The population estimates can be used to calculate rates and per capita measures.", "sfd": "Dataset Overview:\nThis dataset contains geographic boundaries for Modified Zip Code Tabulation Areas (MODZCTA) in New York City. MODZCTAs are custom geographic aggregations of zip codes used by the NYC DOHMH for health data mapping, especially for COVID-19 analysis. The dataset includes MODZCTA codes, labels, corresponding 2010 Census ZCTAs, population estimates, and geospatial data.\n\nRelated Topics:\n- Public Health\n- Geographic Information Systems (GIS)\n- Epidemiology\n- Urban Planning\n- Demographics\n- COVID-19\n- New York City\n\nConcepts and Synonyms:\n- MODZCTA: Modified Zip Code Tabulation Area, custom zip code aggregation\n- ZCTA: Zip Code Tabulation Area, Census ZCTA\n- Geospatial Data: geographic boundaries, shapefiles, `the_geom` column\n- Population Estimates: demographic data, population counts\n- NYC DOHMH: New York City Department of Health and Mental Hygiene\n- Health Data Mapping: disease mapping, spatial epidemiology\n\nApplications and Use Cases:\n- Visualize and analyze health data at the MODZCTA level.\n- Identify areas with specific health needs or health disparities.\n- Calculate rates and per capita measures using population estimates.\n- Inform public health interventions and resource allocation.\n- Map COVID-19 incidence and prevalence across NYC.\n- Integrate with other datasets containing health indicators."}
{"dataset_id": "5tub-eh45", "title": "Street Hail Livery (SHL) Drivers - Active", "original_description": "<b>PLEASE NOTE:</b> This dataset, which includes all TLC Licensed Drivers who are in good standing and able to drive, is updated every day in the evening between 4-7pm. Please check the 'Last Update Date' field to make sure the list has updated successfully. 'Last Update Date'  should show either today or yesterday's date, depending on the time of day. If the list is outdated, please download the most recent list from the link below. \r\nhttp://www1.nyc.gov/assets/tlc/downloads/datasets/tlc_shl_drivers_active.csv\r\n\r\nNYC TLC licensed drivers that are currently active, in good standing and authorized to operate Street Hail Livery (SHL) vehicles. This list is accurate to the date and time represented in the Last Date Updated and Last Time Updated fields. For inquiries about the contents of this dataset, please email licensinginquiries@tlc.nyc.gov.", "topic": "Transportation", "ufd": "This dataset contains information about active, licensed Street Hail Livery (SHL) drivers in New York City. Each row represents a driver and includes their license number, name, status, and license expiration date. The `license_number` is a unique identifier for each driver, and the `name` column provides the driver's name. The `status_description` indicates the driver's current status, which is \"SHL UNRESTRICTED\" for all entries in this sample, meaning they are authorized to operate SHL vehicles. The `expiration_date` shows when the driver's license expires. This dataset is updated daily, with the `last_update_date` and `last_update_time` reflecting the most recent update. You can use this dataset to verify the status of SHL drivers or analyze license expiration trends.", "sfd": "Dataset Overview:\nThis dataset provides details on active, licensed Street Hail Livery (SHL) drivers in New York City. It includes information such as license number, driver name, license status (currently \"SHL UNRESTRICTED\" for all entries), and license expiration date. The dataset is updated daily, offering a current snapshot of SHL driver licensing.\n\nRelated Topics:\n- Street Hail Livery (SHL)\n- Taxi and Limousine Commission (TLC)\n- Driver Licensing\n- Transportation Regulation\n- New York City Transportation\n\nConcepts and Synonyms:\n- Street Hail Livery (SHL): For-hire vehicle, taxi, cab\n- License Number: Driver ID, unique identifier\n- Status Description: License status, active status, authorization status\n- Expiration Date: License renewal date, validity period\n- SHL UNRESTRICTED: Fully licensed, authorized to operate\n\nApplications and Use Cases:\n- Verify the license status of SHL drivers.\n- Analyze trends in SHL driver license expirations.\n- Monitor the number of active SHL drivers in NYC.\n- Support regulatory oversight and compliance efforts related to SHL drivers.\n- Develop applications for driver verification or transportation management."}
{"dataset_id": "5zhs-2jue", "title": "BUILDING", "original_description": "Footprint outlines of buildings in New York City. Please see the following link for additional documentation: https://github.com/CityOfNewYork/nyc-geo-metadata/blob/master/Metadata/Metadata_BuildingFootprints.md\n\nFor additional resources, please refer to: https://nycmaps-nyc.hub.arcgis.com/search?tags=building&type=feature%2520service%2Cfeature%2520layer", "topic": "City Government", "ufd": "This dataset provides detailed information about building footprints in New York City, offering insights into the city's built environment. Each row represents a building footprint, with its geometry described in the `the_geom` column, allowing for spatial analysis. Key attributes include the building identification number (`bin`), Department of Information Technology and Telecommunications ID (`doitt_id`), the building's base BBL (`base_bbl`) and its construction year (`construction_year`). The `shape_area` and `shape_length` columns provide measurements of the building footprint. Additional data includes the source of the geometry (`geom_source`), ground elevation (`ground_elevation`), and roof height (`height_roof`). Researchers, urban planners, and developers can use this dataset to analyze building characteristics, assess urban development patterns, and support various city planning initiatives.", "sfd": "Dataset Overview:\nThis dataset contains detailed building footprint information for New York City. It includes geometric data, unique identifiers, construction year, and measurements like area and length for each building. The data allows for spatial analysis and understanding of the city's built environment.\n\nRelated Topics:\n- Urban Planning\n- City Development\n- Spatial Analysis\n- Building Information\n- New York City\n- Geographic Data\n\nConcepts and Synonyms:\n- Building Footprint: Building outline, building polygon, structure boundary\n- BBL: Borough, Block, Lot; property identification\n- BIN: Building Identification Number\n- DOITT_ID: Department of Information Technology and Telecommunications ID\n- Construction Year: Year Built, Year of Construction\n- Shape_Area: Building Area, Footprint Area\n- Shape_Length: Building Perimeter, Footprint Length\n- Geom_Source: Geometry Source, Data Source\n- Ground_Elevation: Elevation, Ground Level\n- Height_Roof: Roof Height, Building Height\n\nApplications and Use Cases:\n- Analyzing building density and distribution across NYC.\n- Assessing the impact of new developments on existing infrastructure.\n- Identifying areas with older buildings for potential renovation or redevelopment.\n- Creating 3D city models for visualization and simulation.\n- Supporting urban planning initiatives related to zoning and land use.\n- Studying the relationship between building characteristics and environmental factors.\n- Evaluating the impact of building height on shadow patterns."}
{"dataset_id": "dg92-zbpx", "title": "City Record Online", "original_description": "The City Record Online (CROL) is a fully searchable database of notices published in the City Record newspaper, including, but not limited to: public hearings and meetings, public auctions and sales, solicitations and awards and official rules proposed and adopted by city agencies.", "topic": "City Government", "ufd": "This dataset provides a searchable database of notices published in the City Record newspaper. It includes information on public hearings and meetings, auctions and sales, solicitations and awards, and official rules proposed and adopted by city agencies. Key columns include `request_id`, `start_date`, `end_date`, `agency_name`, `short_title`, and `section_name`. The `agency_name` column indicates the specific city agency involved, while `short_title` and `section_name` describe the type of notice. The `additional_description_1` column provides further details, such as effective dates, job titles, and salary information for personnel changes. Researchers and the public can use this dataset to track city government activities, monitor personnel changes, and identify procurement opportunities. The dataset also contains contact information for specific notices, such as phone numbers and email addresses.", "sfd": "Dataset Overview:\nThis dataset contains a comprehensive record of notices published in the City Record, offering insights into the inner workings of city government. It includes details on public hearings, auctions, solicitations, rule changes, and personnel actions across various city agencies. Users can search and filter by agency, notice type, date, and keywords to track specific government activities and opportunities.\n\nRelated Topics:\n- City government transparency\n- Public administration\n- Municipal finance\n- Procurement\n- Regulatory compliance\n- Public hearings and meetings\n\nConcepts and Synonyms:\n- City Record: Official journal, public notice publication, government gazette\n- Agency Name: Department, bureau, commission, city entity\n- Solicitation: Bid, RFP (Request for Proposal), procurement opportunity, contract\n- Public Hearing: Meeting, open forum, community input session\n- Rule Change: Regulation, ordinance, policy amendment, legislation\n- Personnel Action: Hiring, promotion, salary change, appointment\n\nApplications and Use Cases:\n- Tracking proposed rule changes by specific city agencies.\n- Identifying upcoming public hearings related to zoning or development.\n- Monitoring procurement opportunities and contract awards.\n- Researching personnel changes and salary information within city government.\n- Analyzing trends in city government activity over time.\n- Finding contact information for specific notices and inquiries."}
{"dataset_id": "yjxr-fw8i", "title": "Property Valuation and Assessment Data", "original_description": "Real Estate Assessment Property data.\r\nThe Department of Finance values properties every year as one step in calculating property tax bills.", "topic": "City Government", "ufd": "This dataset contains property valuation and assessment data for properties in New York City, collected by the Department of Finance. It includes information used to calculate property tax bills. Key columns include 'boro' (borough), 'block', 'lot', 'owner', 'bldgcl' (building class), and 'taxclass'. The dataset also provides details on lot dimensions ('ltfront', 'ltdepth'), building characteristics ('stories'), and property values ('fullval', 'avland', 'avtot'). Researchers, city planners, and real estate professionals can use this data to analyze property values, understand tax assessments, and gain insights into land use patterns in NYC. The data covers the assessment period of 2018/19.", "sfd": "Dataset Overview:\nThis dataset provides detailed property valuation and assessment information for properties in New York City during the 2018/19 assessment period. Compiled by the Department of Finance, it includes key data points like borough, block, lot, building class, tax class, property dimensions, building characteristics, and assessed values. This data is crucial for understanding property tax calculations and land use patterns across the city.\n\nRelated Topics:\n  - Property Tax\n  - Real Estate\n  - Urban Planning\n  - New York City\n  - Land Use\n  - Municipal Finance\n\nConcepts and Synonyms:\n  - Property Valuation: Assessment, Appraisal, Market Value\n  - Tax Assessment: Property Tax, Levy, Rate\n  - Borough: County, District, Region (e.g., Manhattan, Brooklyn)\n  - Building Class: Bldgcl, Property Type, Land Use Code\n  - Lot Dimensions: Ltfront, Ltdepth, Property Size, Parcel Size\n  - Assessed Value: Fullval, Avland, Avtot, Taxable Value\n\nApplications and Use Cases:\n  - Analyze property value trends across different boroughs.\n  - Develop predictive models for property tax revenue.\n  - Identify areas with high or low property values for urban planning purposes.\n  - Investigate the relationship between building characteristics and assessed values.\n  - Compare property tax burdens across different property types.\n  - Support real estate investment decisions."}
{"dataset_id": "n2zq-pubd", "title": "NYPD Calls for Service (Year to Date)", "original_description": "Calls for Service to NYPD's 911 system</br>\nThis dataset documents entries  into the NYPD 911 system, ICAD.  The data is collected from the ICAD system which call takers and dispatchers use to communicate with callers and the NYPD.  Each record represents an entry into the system.  The data includes entries generated by members of the public as well as self-initiated entries by NYPD Members of Service. The data can be used for issues being responded to by the NYPD.", "topic": "Public Safety", "ufd": "This dataset contains information about calls for service to the NYPD's 911 system, documenting each entry into the ICAD system. It includes details on incidents reported by the public and self-initiated entries by NYPD personnel. Key columns include `incident_date` and `incident_time`, specifying when the incident occurred, `nypd_pct_cd` indicating the police precinct, and `boro_nm` representing the borough where the incident took place. The `typ_desc` column provides a description of the incident type, while `latitude` and `longitude` offer geographic coordinates. Researchers and public safety analysts can use this data to analyze incident trends, response times, and resource allocation across different areas of New York City. The dataset also includes timestamps for when the call was added (`add_ts`), dispatched (`disp_ts`), when officers arrived (`arrivd_ts`), and when the incident was closed (`closng_ts`).", "sfd": "Dataset Overview:\nThis dataset details calls for service to the NYPD 911 system, capturing incidents reported by the public and self-initiated actions by NYPD personnel. It includes information on incident type, location (borough, precinct, latitude, longitude), and timestamps for key stages like call addition, dispatch, arrival, and closure. Researchers and analysts can use this data to study crime patterns, response times, and resource allocation within New York City.\n\nRelated Topics:\n- Crime Statistics\n- Emergency Response\n- Law Enforcement\n- Urban Planning\n- Public Health\n- Geographic Information Systems (GIS)\n\nConcepts and Synonyms:\n- 911 Calls: Emergency calls, calls for service, incident reports\n- NYPD: New York Police Department, law enforcement agency\n- Incident Type: Crime type, offense description, typ_desc\n- Precinct: Police precinct, nypd_pct_cd, police district\n- Borough: Boro_nm, city borough, administrative division\n- Response Time: Arrivd_ts - disp_ts, time to arrival, emergency response duration\n- Geographic Coordinates: Latitude, longitude, geospatial data, location data\n\nApplications and Use Cases:\n- Analyze crime hotspots and trends across different boroughs and precincts.\n- Evaluate NYPD response times to different types of incidents.\n- Optimize resource allocation based on incident frequency and severity.\n- Visualize incident locations on a map to identify patterns.\n- Study the relationship between incident types and socio-economic factors.\n- Develop predictive models for crime forecasting.\n- Assess the impact of public safety initiatives on crime rates."}
{"dataset_id": "m6nq-qud6", "title": "2021 Yellow Taxi Trip Data", "original_description": "These records are generated from the trip record submissions made by yellow taxi Technology Service Providers (TSPs). Each row represents a single trip in a yellow taxi. The trip records include fields capturing pick-up and drop-off dates/times, pick-up and drop-off taxi zone locations, trip distances, itemized fares, rate types, payment types, and driver-reported passenger counts.", "topic": "Transportation", "ufd": "This dataset contains trip records for yellow taxis in 2021. Each row represents a single taxi trip, including details about pick-up and drop-off times and locations. You can identify the taxi company using the `vendorid` and the specific pick-up and drop-off zones via `pulocationid` and `dolocationid`, respectively. The dataset also provides information on the number of passengers (`passenger_count`) and the distance traveled (`trip_distance`). Furthermore, it breaks down the fare into different components such as `fare_amount`, `tip_amount`, `tolls_amount`, and other surcharges, culminating in the `total_amount`. Researchers and analysts can use this data to study taxi ridership patterns, analyze fare structures, or build predictive models for trip demand. The `store_and_fwd_flag` indicates if the trip record was temporarily stored in the vehicle before being sent to the vendor.", "sfd": "Dataset Overview:\nThis dataset provides detailed trip information for yellow taxis in 2021. It includes pick-up and drop-off locations and times, passenger count, trip distance, and a breakdown of fare components. The data allows for analysis of taxi ridership patterns and fare structures.\n\nRelated Topics:\n- Taxi trips\n- Transportation data\n- Fare analysis\n- Geographic data\n- Ridership patterns\n\nConcepts and Synonyms:\n- Vendor ID: Taxi company identifier\n- PULocationID: Pick-up location ID\n- DOLocationID: Drop-off location ID\n- Trip Distance: Distance traveled\n- Fare Amount: Base fare\n- Tip Amount: Gratuity\n- Total Amount: Total fare including all charges\n- Store and Forward Flag: Data transmission delay indicator\n\nApplications and Use Cases:\n- Analyze taxi ridership trends over time.\n- Predict taxi demand based on location and time.\n- Study the impact of tolls and surcharges on taxi fares.\n- Identify popular pick-up and drop-off locations.\n- Build a model to estimate trip costs."}
{"dataset_id": "25th-nujf", "title": "Popular Baby Names", "original_description": "Popular Baby Names by Sex and Ethnic Group\r\nData were collected through civil birth registration. Each record represents the ranking of a baby name in the order of frequency. Data can be used to represent the popularity of a name. Caution should be used when assessing the rank of a baby name if the frequency count is close to 10; the ranking may vary year to year.", "topic": "Health", "ufd": "This dataset provides insights into the popularity of baby names in 2021. Specifically, it focuses on female names within the Asian and Pacific Islander ethnic group. Each row represents a unique name and its corresponding count, indicating how many times that name was registered. The 'rnk' column shows the popularity rank of each name, with lower numbers indicating higher popularity. Researchers and parents can use this data to explore naming trends and identify popular names within this demographic. The dataset includes the birth year ('brth_yr'), gender ('gndr'), ethnicity ('ethcty'), name ('nm'), count ('cnt'), and rank ('rnk'). Be mindful when interpreting ranks with low frequency counts, as these can fluctuate.", "sfd": "Dataset Overview:\nThis dataset details the popularity of female baby names within the Asian and Pacific Islander ethnic group in 2021. It includes the name, count of occurrences, and popularity rank for each name. The data allows for analysis of naming trends and identification of common names within this specific demographic.\n\nRelated Topics:\n- Baby Names\n- Demographics\n- Ethnicity\n- Naming Trends\n- Population Statistics\n- Cultural Studies\n- Genealogy\n\nConcepts and Synonyms:\n- Baby Names: Infant Names, First Names, Given Names\n- Popularity Rank: Ranking, Position, Order\n- Asian and Pacific Islander: API, Ethnicity, Cultural Group\n- Count: Frequency, Number of Occurrences, Registration Count\n- Naming Trends: Name Popularity, Name Fashions, Naming Conventions\n\nApplications and Use Cases:\n- Analyzing naming trends within the Asian and Pacific Islander community.\n- Identifying popular baby names for girls in 2021.\n- Comparing name popularity across different ethnic groups (if other datasets are available).\n- Developing resources for expectant parents seeking name ideas.\n- Studying the cultural significance of names within the API community."}
{"dataset_id": "pasr-j7fb", "title": "Emergency Response Incidents", "original_description": "Type and address of emergency incident to which OEM responded", "topic": "Public Safety", "ufd": "This dataset contains information about emergency response incidents. It includes the type of incident (e.g., Utility-Water Main, Fire-2nd Alarm), the location as a street address, and the borough where the incident occurred. The dataset also provides the date and time the incident was created, along with latitude and longitude coordinates. The 'incident_type' column categorizes the emergency, while 'location' and 'borough' specify where it happened. The 'creation_date' indicates when the incident was reported. This data could be used to analyze the types and locations of emergencies, identify trends, and improve resource allocation for emergency services. Note that the 'closed_date' column has mostly missing values.", "sfd": "Dataset Overview:\nThis dataset details emergency response incidents, including the incident type, location (street address and borough), and creation date/time. Latitude and longitude coordinates are also provided for each incident. The data can be used to analyze emergency trends and improve resource allocation.\n\nRelated Topics:\n- Emergency Management\n- Public Health\n- Urban Planning\n- Geographic Information Systems (GIS)\n\nConcepts and Synonyms:\n- Incident Type: Emergency Category, Event Type, Call Type\n- Location: Address, Street, Borough, Coordinates, Geo-location\n- Creation Date: Incident Date, Report Date, Time of Incident\n- Emergency Response: First Responders, Public Safety, Crisis Management\n\nApplications and Use Cases:\n- Analyze the frequency and distribution of different types of emergencies.\n- Identify high-risk areas for specific incidents based on location data.\n- Optimize emergency response times by analyzing historical incident data.\n- Visualize incident patterns on a map using latitude and longitude coordinates.\n- Predict future emergency hotspots based on historical trends."}
{"dataset_id": "i6b5-j7bu", "title": "Street Closures due to construction activities by Block", "original_description": "DOT Street Closure data identifies locations in the New York City Street Closure map where a street is subject to a full closure, restricting through traffic, for the purpose of conducting construction related activity on a City street. Details about DOT construction permits can be found at Street Works Manual, http://streetworksmanual.nyc/.  Full Closure Permits are issued for a period of time during which the street may be closed to through traffic for only a portion of the time, and open at other times.", "topic": "Transportation", "ufd": "This dataset provides information on street closures in New York City due to construction activities. It includes the location of the street closure as a geographic feature (`the_geom`), the street name where the closure occurs (`onstreetname`), and the intersecting streets that define the closed segment (`fromstreetname`, `tostreetname`). The dataset also specifies the borough (`borough_code`) where the closure is located. Key temporal information includes the start and end dates of the work causing the closure (`work_start_date`, `work_end_date`). The `purpose` column describes the type of construction activity taking place. This data can be used to understand the impact of construction on traffic flow, plan alternative routes, or analyze the frequency and duration of street closures in different boroughs. The `segmentid` and `uniqueid` columns can be used to uniquely identify each street closure segment.", "sfd": "Dataset Overview:\nThis dataset details street closures in New York City resulting from construction. It includes geographic location, street names (closed street and intersecting streets), borough, start and end dates of the work, and the purpose of the construction. The data allows for analysis of construction impact on traffic and street closure patterns.\n\nRelated Topics:\n- Road closures\n- Construction\n- Traffic management\n- Urban planning\n- New York City\n- Transportation infrastructure\n\nConcepts and Synonyms:\n- Street closure: road closure, street obstruction, road blockage\n- Construction: work, maintenance, repair, infrastructure project\n- Street name: onstreetname, fromstreetname, tostreetname\n- Borough: NYC borough, county\n- Work start date: start date, begin date\n- Work end date: end date, completion date\n- Purpose: construction type, activity, reason for closure\n\nApplications and Use Cases:\n- Traffic rerouting and navigation app development\n- Analysis of construction impact on local businesses\n- Urban planning and infrastructure management\n- Prediction of future street closures based on historical data\n- Identification of high-impact construction zones"}
{"dataset_id": "bm4k-52h4", "title": "Motor Vehicle Collisions - Vehicles", "original_description": "The Motor Vehicle Collisions vehicle table contains details on each vehicle involved in the crash. Each row represents a motor vehicle involved in a crash. The data in this table goes back to April 2016 when crash reporting switched to an electronic system.\r\n</p>\r\nThe Motor Vehicle Collisions data tables contain information from all police reported motor vehicle collisions in NYC. The police report (MV104-AN) is required to be filled out for collisions where someone is injured or killed, or where there is at least $1000 worth of damage (https://www.nhtsa.gov/sites/nhtsa.dot.gov/files/documents/ny_overlay_mv-104an_rev05_2004.pdf).  It should be noted that the data is preliminary and subject to change when the MV-104AN forms are amended based on revised crash details.\r\n</p>\r\nDue to success of the CompStat program, NYPD began to ask how to apply the CompStat principles  to other problems.  Other than homicides, the fatal incidents with which police have the most contact with the public are fatal traffic collisions.  Therefore in April 1998, the Department implemented TrafficStat, which uses the CompStat model to work towards improving traffic safety.  Police officers complete form MV-104AN  for all vehicle collisions.  The MV-104AN is a New York State form that has all of the details of a traffic collision.  Before implementing Trafficstat, there was no uniform traffic safety data collection procedure for all of the NYPD precincts.  Therefore, the Police Department implemented the Traffic Accident Management System (TAMS) in July 1999 in order to collect traffic data in a uniform method across the City.  TAMS required the precincts manually enter a few selected MV-104AN fields to collect very basic intersection traffic crash statistics which included the number of accidents, injuries and fatalities. As the years progressed, there grew a need for additional traffic data so that more detailed analyses could be conducted. The Citywide traffic safety initiative, Vision Zero started in the year 2014.  Vision Zero further emphasized the need for the collection of more traffic data in order to work towards the Vision Zero goal, which is to eliminate traffic fatalities.  Therefore, the Department in March 2016 replaced the TAMS with the new Finest Online Records Management System (FORMS).  FORMS enables the police officers to electronically, using a Department cellphone or computer, enter all of the MV-104AN data fields and stores all of the MV-104AN data fields in the Department’s crime data warehouse.  Since all of the MV-104AN data fields are now stored for each traffic collision, detailed traffic safety analyses can be conducted as applicable.", "topic": "Public Safety", "ufd": "This dataset contains information about motor vehicle collisions in NYC, with each row representing a vehicle involved in a crash. Key details include the crash date and time, the type of vehicle, and the state registration. You can also find contributing factors to the collision. The dataset provides a unique ID for each vehicle and the corresponding collision ID. This data could be used to analyze trends in vehicle collisions, identify common contributing factors, or assess the types of vehicles most frequently involved in accidents. The 'travel_direction', 'pre_crash', and 'point_of_impact' columns offer insights into the circumstances surrounding the collisions. Note that some columns, such as vehicle make and year, have a high percentage of missing values.", "sfd": "Dataset Overview:\nThis dataset details motor vehicle collisions in New York City, with each record representing a vehicle involved in a crash. It includes information on the crash date and time, vehicle type, state registration, and contributing factors. Unique identifiers for both the vehicle and the collision are provided.\n\nRelated Topics:\n- Traffic Safety\n- Accident Analysis\n- Urban Planning\n- Vehicle Safety\n- New York City\n- Public Health\n\nConcepts and Synonyms:\n- Motor Vehicle Collision: Car accident, traffic collision, vehicle crash, auto accident\n- Contributing Factors: Cause of accident, reasons for collision, factors leading to crash\n- Vehicle Type: Car model, vehicle make, type of vehicle\n- State Registration: License plate state, vehicle registration state\n- Point of Impact: Location of impact, area of collision\n\nApplications and Use Cases:\n- Analyze trends in vehicle collisions over time.\n- Identify common contributing factors to accidents.\n- Assess the types of vehicles most frequently involved in collisions.\n- Develop targeted safety interventions based on collision data.\n- Improve traffic safety policies and infrastructure planning."}
{"dataset_id": "bs8b-p36w", "title": "DOB Certificate Of Occupancy", "original_description": "A Certificate of Occupancy (CO) states a building’s legal use and/or type of permitted occupancy. New buildings must have a CO, and existing buildings must have a current or amended CO when there is a change in use, egress or type of occupancy. No one may legally occupy a building until the Department has issued a Certificate of Occupancy or Temporary Certificate of Occupancy. The Department issues a final Certificate of Occupancy when the completed work matches the submitted plans for new buildings or major alterations. It issues a Letter of Completion for minor alterations to properties. These documents confirm the work complies with all applicable laws, all paperwork has been completed, all fees owed to the Department have been paid, all relevant violations have been resolved and all necessary approvals have been received from other City Agencies.\n\nThis dataset contains all Certificates of Occupancy issued from 7/12/2012 to March 2021. PDFs of the actual COs are viewable in www.nyc.gov/bis.\n\nFor COs issued since March 2021, see <a href=\"https://data.cityofnewyork.us/Housing-Development/DOB-NOW-Certificate-of-Occupancy/pkdm-hqz6\">DOB NOW: Certificate of Occupancy</a> dataset.", "topic": "Housing & Development", "ufd": "This dataset contains information on Certificates of Occupancy (CO) issued by the New York City Department of Buildings (DOB) from July 2012 to March 2021. A Certificate of Occupancy states a building’s legal use and type of permitted occupancy. Each row represents a specific CO, identified by a unique job number. Key details include the job type (e.g., A1 or NB), the date the CO was issued, the borough where the property is located, and the building identification number (BIN). You can also find the house number, street name, block, lot, and postcode for the property. This dataset could be used to analyze trends in building occupancy, assess housing development patterns across different boroughs, or examine the timeline of CO issuances for specific properties. The dataset also includes geographic information such as latitude, longitude, community board, council district, and census tract.", "sfd": "Dataset Overview:\nThis dataset details Certificates of Occupancy (CO) issued by the NYC DOB from July 2012 to March 2021. Each record represents a unique CO, identified by job number, and includes information on the property's legal use, occupancy type, location, and issuance date. The data spans all five boroughs and includes geographic identifiers like latitude, longitude, and census tract.\n\nRelated Topics:\n- Real Estate\n- Urban Planning\n- Construction\n- New York City\n- Building Permits\n- Housing Development\n- Zoning Regulations\n\nConcepts and Synonyms:\n- Certificate of Occupancy (CO): Legal document, occupancy permit, building occupancy certificate\n- Department of Buildings (DOB): Building department, city planning agency\n- Job Number: Project ID, application number, permit number\n- Building Identification Number (BIN): Property ID, building number\n- Borough: NYC borough (Manhattan, Brooklyn, Queens, Bronx, Staten Island)\n- Occupancy Type: Residential, commercial, industrial, mixed-use\n\nApplications and Use Cases:\n- Analyze trends in building occupancy types over time.\n- Map housing development and construction activity across NYC boroughs.\n- Identify properties with specific occupancy types in particular neighborhoods.\n- Examine the relationship between CO issuance dates and other property characteristics.\n- Investigate the geographic distribution of new construction and renovations.\n- Predict future housing development based on historical CO issuance patterns."}
{"dataset_id": "xi7c-iiu2", "title": "New York City Population By Community Districts", "original_description": "New York City Population By Community Districts\r\n\r\nThe data was collected from Census Bureaus' Decennial data dissemination (SF1) for the years 1970, 1980, 1990, 2000 and 2010.\r\n\r\nCompiled by the Population Division – New York City Department of City Planning", "topic": "City Government", "ufd": "This dataset contains population figures for New York City community districts from 1970 to 2010, collected from the Census Bureau. Each row represents a community district, identified by its borough (e.g., Bronx, Brooklyn), a community district number, and a descriptive name. The dataset includes population counts for each district for the census years 1970, 1980, 1990, 2000, and 2010. This data can be used to analyze population trends and demographic changes within different community districts over time. Researchers, city planners, and policymakers can leverage this information for urban development, resource allocation, and understanding the evolving needs of different neighborhoods. The data was compiled by the Population Division of the New York City Department of City Planning.", "sfd": "Dataset Overview:\nThis dataset provides population data for New York City community districts from 1970 to 2010, sourced from the Census Bureau. It includes population counts for each district across five census years: 1970, 1980, 1990, 2000, and 2010. The data is organized by borough, community district number, and community district name, enabling analysis of population trends within specific areas of New York City.\n\nRelated Topics:\n- Demographics\n- Urban Planning\n- Census Data\n- New York City\n- Population Trends\n- Community Development\n\nConcepts and Synonyms:\n- Community District: Neighborhood, Local Area, Borough\n- Population: Inhabitants, Residents, Headcount\n- Census: Demographic Survey, Population Count, Official Enumeration\n- Demographic Change: Population Shift, Population Growth, Population Decline\n- NYC Department of City Planning: DCP, City Planning, Population Division\n\nApplications and Use Cases:\n- Analyze population growth and decline in different NYC neighborhoods.\n- Inform urban planning and resource allocation decisions.\n- Study demographic shifts within community districts over time.\n- Compare population trends across different boroughs.\n- Support research on the impact of policy changes on population distribution."}
{"dataset_id": "ia2d-e54m", "title": "Water Consumption in the City of New York", "original_description": "A brief history of water consumption in the New York City Water Supply System (Based on New York City Census population)", "topic": "Environment", "ufd": "This dataset provides a historical record of water consumption in New York City, offering insights into the city's water usage patterns over time. It includes data from 1960 to 2024, detailing the city's population, total water consumption in millions of gallons per day, and per capita water consumption. The 'year' column indicates the year of the data, while 'new_york_city_population' represents the population count for that year. 'nyc_consumption_million_gallons_per_day' shows the total water consumed, and 'per_capita_gallons_per_person_per_day' calculates the average water usage per person. Researchers, urban planners, and environmental scientists can use this data to analyze trends in water consumption, understand the relationship between population and water demand, and develop strategies for sustainable water management in urban environments. The dataset can also be used to forecast future water needs and assess the impact of conservation efforts.", "sfd": "Dataset Overview:\nThis dataset contains historical water consumption data for New York City from 1960 to 2024. It includes yearly population figures, total water consumption in millions of gallons per day, and per capita water consumption. This data allows for analysis of water usage trends and the relationship between population and water demand in NYC.\n\nRelated Topics:\n  - Water Resources\n  - Urban Planning\n  - Environmental Science\n  - Population Studies\n  - Sustainability\n  - New York City\n\nConcepts and Synonyms:\n  - Water Consumption: Water usage, water demand, water withdrawal\n  - Population: Demographics, inhabitants, residents\n  - Per Capita Consumption: Water use per person, average daily use\n  - Million Gallons Per Day (MGD): Volume of water, flow rate\n  - New York City: NYC, Manhattan, urban area\n\nApplications and Use Cases:\n  - Analyze historical trends in NYC water consumption.\n  - Model and forecast future water demand based on population growth.\n  - Evaluate the effectiveness of water conservation programs.\n  - Study the relationship between population density and water usage.\n  - Compare NYC water consumption patterns to other major cities.\n  - Develop strategies for sustainable water management in urban environments."}
{"dataset_id": "bqiq-cu78", "title": "NYPD Hate Crimes", "original_description": "Dataset containing confirmed hate crime incidents in NYC", "topic": "Public Safety", "ufd": "This dataset contains records of confirmed hate crimes in New York City. Each row represents a single complaint, identified by a unique `full_complaint_id`. The data includes the year and month of the complaint (`complaint_year_number`, `month_number`), as well as the date the record was created (`record_create_date`). Location information is provided through the `complaint_precinct_code`, `patrol_borough_name`, and `county` columns. Details about the offense are captured in columns like `law_code_category_description`, `offense_description`, and `pd_code_description`. The `bias_motive_description` column specifies the motive behind the hate crime, and `offense_category` provides a general classification of the crime. This dataset could be used to analyze trends in hate crimes over time and across different locations in NYC, understand the types of offenses being committed, and identify the motivations behind these crimes. The dataset is limited to Anti-Jewish hate crimes in Brooklyn South.", "sfd": "Dataset Overview:\nThis dataset details confirmed Anti-Jewish hate crimes reported in Brooklyn South, New York City. Each record represents a single complaint and includes information on the date, location (precinct, borough, county), offense details (law code, offense description, PD code), bias motive, and offense category. The data spans multiple years and can be used to analyze trends and patterns in Anti-Jewish hate crimes within Brooklyn South.\n\nRelated Topics:\n- Hate Crimes\n- Public Safety\n- Law Enforcement\n- New York City\n- Brooklyn\n- Anti-Semitism\n- Bias Incidents\n- Crime Statistics\n\nConcepts and Synonyms:\n- Hate Crime: Bias incident, bias-motivated crime, prejudice-motivated offense\n- Offense Description: Crime type, violation, infraction\n- Bias Motive: Motivation, prejudice, underlying cause\n- Complaint Precinct Code: Police precinct, district\n- Patrol Borough Name: Borough, county\n- Anti-Jewish: Anti-Semitism, Jewish targeted, hate against Jews\n\nApplications and Use Cases:\n- Analyze trends in Anti-Jewish hate crimes over time in Brooklyn South.\n- Identify high-risk areas for Anti-Jewish hate crimes based on precinct and patrol borough.\n- Understand the types of offenses most frequently committed in Anti-Jewish hate crimes.\n- Investigate the motivations behind Anti-Jewish hate crimes.\n- Develop targeted prevention and intervention strategies.\n- Track the effectiveness of law enforcement responses to Anti-Jewish hate crimes."}
{"dataset_id": "eccv-9dzr", "title": "CURRENT BASES", "original_description": "<b>For up-to-date list of FHV bases, please visit <a href=\"https://www1.nyc.gov/site/tlc/businesses/for-hire-vehicle-bases.page\">this page</a><b>", "topic": "Transportation", "ufd": "This dataset provides information on current For-Hire Vehicle (FHV) bases in New York City. Each row represents a unique base and includes details such as the license number, entity name, telephone number, and physical address (building, street, city, state, and zip code). The `type_of_base` column specifies the type of service offered, such as \"Livery Base,\" \"Black Car Base,\" or \"Luxury/Limousine.\" Location data is also provided in the form of latitude and longitude coordinates. The dataset also includes computed region identifiers. You can use this dataset to identify and locate FHV bases, analyze their distribution across the city, or examine the prevalence of different base types. Note that the dataset provides a link to the official NYC website for the most up-to-date information.", "sfd": "Dataset Overview:\nThis dataset contains information about For-Hire Vehicle (FHV) bases operating in New York City. It includes details on each base's license, name, contact information, address, and geographic coordinates. The dataset also specifies the type of service offered by each base (e.g., Livery, Black Car).\n\nRelated Topics:\n- Transportation\n- New York City\n- For-Hire Vehicles\n- Taxi and Limousine Commission (TLC)\n- Geographic Data\n- Business Locations\n\nConcepts and Synonyms:\n- For-Hire Vehicle (FHV): Taxi, Livery, Black Car, Limousine\n- Base: Dispatch Center, Headquarters, Operating Location\n- License Number: Permit Number, Registration ID\n- Geographic Coordinates: Latitude, Longitude, Geolocation\n- Type of Base: Service Type, Business Category\n\nApplications and Use Cases:\n- Mapping the distribution of FHV bases across NYC neighborhoods.\n- Analyzing the prevalence of different FHV base types.\n- Identifying FHV bases near specific locations.\n- Validating the location and contact information of FHV bases.\n- Studying the relationship between FHV base locations and demographic factors."}
{"dataset_id": "qyyg-4tf5", "title": "Recent Contract Awards", "original_description": "The Office of Citywide Procurement (OCP) solicits and awards contracts for a wide variety of goods and services on behalf of all City agencies.", "topic": "City Government", "ufd": "This dataset contains information on recent contract awards by New York City agencies. It's a record of the City's procurement activities, managed by the Office of Citywide Procurement. Key details include the agency making the award (`agency_name`), the type and category of service or goods being contracted (`type_of_notice_description`, `category_description`), and a brief description of the contract (`short_title`). The dataset also provides the start and end dates of the award, the method used for selecting the vendor (`selection_method_description`), and the contract amount (`contract_amount`). You can use this data to understand which agencies are awarding contracts, the types of services being procured, and the monetary value of these contracts. Contact information for each award, such as contact name and email, is also provided. This information can be valuable for businesses seeking to work with the City, as well as for citizens interested in government spending and procurement practices.", "sfd": "Dataset Overview:\nThis dataset details recent contract awards made by New York City agencies, documenting the city's procurement activities. It includes information on the awarding agency, the type of goods or services contracted, contract dates, and the contract amount. The data also contains vendor selection methods and contact information for each award.\n\nRelated Topics:\n  - Government Procurement\n  - City Contracts\n  - Public Spending\n  - Vendor Management\n  - New York City Government\n\nConcepts and Synonyms:\n  - Contract Award: Procurement, Agreement, Deal\n  - Agency Name: Department, Bureau, Office\n  - Contract Amount: Award Value, Total Cost, Financial Commitment\n  - Selection Method: Procurement Method, Vendor Selection Process, Competitive Bidding\n  - Type of Notice: Contract Type, Service Category, Goods Category\n\nApplications and Use Cases:\n  - Identify potential business opportunities with NYC agencies.\n  - Analyze trends in city spending across different service categories.\n  - Evaluate the effectiveness of different vendor selection methods.\n  - Track contract performance and identify potential risks.\n  - Investigate potential conflicts of interest in contract awards."}
{"dataset_id": "8m42-w767", "title": "Fire Incident Dispatch Data", "original_description": "The Fire Incident Dispatch Data file contains data that is generated by the Starfire Computer Aided Dispatch System. The data spans from the time the incident is created in the system to the time the incident is closed in the system.  It covers information about the incident as it relates to the assignment of resources and the Fire Department’s response to the emergency. To protect personal identifying information in accordance with the Health Insurance Portability and Accountability Act (HIPAA), specific locations of incidents are not included and have been aggregated to a higher level of detail.", "topic": "Public Safety", "ufd": "This dataset contains information about fire incidents in New York City, as recorded by the Starfire Computer Aided Dispatch System. Each row represents a unique incident, identified by a `starfire_incident_id`, and includes the date and time the incident occurred (`incident_datetime`). The data provides details on the location of the incident, including the `alarm_box_borough`, `alarm_box_number`, and `alarm_box_location`, as well as broader geographic information like `zipcode`, `policeprecinct`, and `citycouncildistrict`. You can explore the nature of the incidents through the `incident_classification` and `incident_classification_group` columns, and understand the severity using `alarm_level_index_description` and `highest_alarm_level`. The dataset also tracks response times, such as `dispatch_response_seconds_qy` and `incident_response_seconds_qy`, along with the number of engines, ladders, and other units assigned. Researchers and public safety analysts can use this data to analyze incident patterns, evaluate response times, and optimize resource allocation. The data spans from incident creation to closure, offering a comprehensive view of the Fire Department's response to emergencies.", "sfd": "Dataset Overview:\nThis dataset details fire incidents in New York City, captured by the Starfire Computer Aided Dispatch System. Each record represents a unique incident, providing information on location, incident type, alarm levels, and response times. The data allows for analysis of incident patterns, response effectiveness, and resource allocation within the Fire Department.\n\nRelated Topics:\n- Fire Department of New York (FDNY)\n- Emergency Response\n- Public Safety\n- Incident Management\n- Geographic Information Systems (GIS)\n- Resource Allocation\n- Urban Planning\n\nConcepts and Synonyms:\n- Fire Incident: Fire, emergency, conflagration, blaze\n- Response Time: Dispatch time, arrival time, incident response time\n- Alarm Level: Severity, priority, escalation\n- Incident Classification: Type of incident, nature of emergency, cause of fire\n- Location: Address, borough, zip code, geographic coordinates\n- Starfire CAD: Computer Aided Dispatch System, incident reporting system\n\nApplications and Use Cases:\n- Analyze fire incident patterns and trends across different boroughs and zip codes.\n- Evaluate the effectiveness of fire department response times and identify areas for improvement.\n- Optimize resource allocation by understanding the demand for fire services in different areas.\n- Develop predictive models to forecast fire risk based on location, time of year, and other factors.\n- Support urban planning and infrastructure development by identifying areas with high fire incident rates.\n- Assess the impact of fire safety regulations and public awareness campaigns."}
{"dataset_id": "rc75-m7u3", "title": "COVID-19 Daily Counts of Cases, Hospitalizations, and Deaths", "original_description": "Daily count of NYC residents who tested positive for SARS-CoV-2, who were hospitalized with COVID-19, and deaths among COVID-19 patients.\n\nNote that this dataset currently pulls from https://raw.githubusercontent.com/nychealth/coronavirus-data/master/trends/data-by-day.csv on a daily basis.", "topic": "Health", "ufd": "This dataset provides daily COVID-19 statistics for New York City residents. It includes the daily counts of positive cases (both confirmed and probable), hospitalizations, and deaths. You can also find the 7-day averages for these metrics, offering a smoothed view of trends. The data is broken down by borough (Bronx, Brooklyn, Manhattan, Queens, and Staten Island), allowing for granular analysis of the pandemic's impact across the city. The `date_of_interest` column indicates the day for which the data is reported. Researchers and public health officials can use this dataset to track the spread of COVID-19, assess the effectiveness of interventions, and understand the burden on the healthcare system.", "sfd": "Dataset Overview:\nThis dataset contains daily COVID-19 statistics for New York City, broken down by borough. It includes daily counts and 7-day averages for positive cases (confirmed and probable), hospitalizations, and deaths. The data allows for tracking the pandemic's impact across different areas of the city over time.\n\nRelated Topics:\n  - Public Health\n  - Epidemiology\n  - Infectious Diseases\n  - New York City\n  - Disease Surveillance\n  - Healthcare Data\n\nConcepts and Synonyms:\n  - COVID-19: Coronavirus, SARS-CoV-2\n  - Positive Cases: Confirmed Cases, Probable Cases, Infections\n  - Hospitalizations: Hospital Admissions, Patients in Hospital\n  - Deaths: Fatalities, Mortality, Death Count\n  - Borough: County, District, Region (Bronx, Brooklyn, Manhattan, Queens, Staten Island)\n  - 7-Day Average: Rolling Average, Moving Average, Trend Line\n\nApplications and Use Cases:\n  - Track the spread of COVID-19 in NYC boroughs.\n  - Analyze trends in hospitalizations and deaths related to COVID-19.\n  - Evaluate the effectiveness of public health interventions.\n  - Compare the impact of COVID-19 across different boroughs.\n  - Forecast future case numbers and hospitalizations."}
{"dataset_id": "7zb8-7bpk", "title": "Property Tax Rates by Tax Class", "original_description": "Table of tax rates by year", "topic": "City Government", "ufd": "This dataset provides a table of property tax rates by tax class for a city government. It includes tax rates for four different classes of property (class_1, class_2, class_3, and class_4) across different years. The 'year' column indicates the tax year for which the rates apply. Each of the class columns (class_1 through class_4) represents the tax rate for that specific property class. This dataset could be used to analyze trends in property tax rates over time for different property types. City planners, residents, or real estate professionals might find this information useful for understanding the local tax landscape. The dataset contains 28 rows, spanning different tax years.", "sfd": "Dataset Overview:\nThis dataset contains property tax rates for a city government, broken down by property class (class_1, class_2, class_3, class_4) and year. It provides a historical view of tax rates for different property types. The data spans multiple years and allows for analysis of tax rate trends.\n\nRelated Topics:\n- Property Tax\n- Municipal Finance\n- Urban Planning\n- Real Estate\n- Local Government\n\nConcepts and Synonyms:\n- Property Tax Rate: Tax levy, millage rate\n- Property Class: Tax class, property type, assessment class\n- Tax Year: Fiscal year, assessment year\n- City Government: Municipal government, local administration\n\nApplications and Use Cases:\n- Analyze trends in property tax rates over time.\n- Compare tax rates across different property classes.\n- Forecast future property tax revenues.\n- Inform property investment decisions.\n- Evaluate the impact of tax policies on different property types."}
{"dataset_id": "6kbp-uz6m", "title": "Sidewalk Management Database - Violations", "original_description": "Sidewalk Management System is used to track and organize inspections, violations and the status of New York City sidewalks. Identifies a Notice of Violation has been issued for a sidewalk defect.\nFor more information please visit NYC DOT website: www.nyc.gov/sidewalks", "topic": "Transportation", "ufd": "This dataset contains information on sidewalk violations in New York City, managed through the Sidewalk Management System. It tracks inspections, violations, and the status of sidewalks. Key columns include `violationid`, a unique identifier for each violation, and address information split across columns like `house_num`, `frstname` (street name from), and `tostname` (street name to). Several date fields are present, such as `vissuedate` (violation issued date), `certi_date` (certification date), `vdismissdate` (violation dismissal date), `post_date` (posting date) and `entrydate` (date of entry). The dataset also includes flags indicating specific sidewalk defects like `broken` sidewalks or `trip_haz`ards. The `contract` column identifies the contract associated with the violation. Researchers and city planners can use this data to analyze sidewalk conditions, track violation trends, and improve sidewalk maintenance strategies.", "sfd": "Dataset Overview:\nThis dataset details sidewalk violations recorded in New York City through the Sidewalk Management System. It includes information on inspections, violations issued, and sidewalk status. Key details include violation IDs, address information, various dates related to the violation lifecycle, and flags indicating specific sidewalk defects.\n\nRelated Topics:\n- Urban Planning\n- Infrastructure Management\n- Public Safety\n- City Maintenance\n- Transportation\n- New York City\n\nConcepts and Synonyms:\n- Sidewalk Violation: Pavement defect, walkway infraction, sidewalk hazard\n- Violation ID: Violation identifier, unique violation number\n- Sidewalk Management System: SMS, sidewalk maintenance database\n- House Number: Building number, address number\n- Street Name: Road name, avenue, boulevard\n- Violation Issue Date: Vissuedate, date of violation, date of notice\n- Sidewalk Defects: Broken sidewalk, trip hazard, uneven pavement\n\nApplications and Use Cases:\n- Analyze trends in sidewalk violations across different neighborhoods.\n- Identify areas with high rates of specific sidewalk defects.\n- Evaluate the effectiveness of sidewalk maintenance programs.\n- Predict future sidewalk maintenance needs based on historical data.\n- Improve resource allocation for sidewalk repairs.\n- Track the lifecycle of sidewalk violations from issuance to resolution."}
{"dataset_id": "693u-uax6", "title": "Parking Meters Locations and Status", "original_description": "Multiple space muni-meters located along streets and municipal parking facilities where metered parking are available. For any parking meter complaint, please visit the <a href=\"https://portal.311.nyc.gov/article/?kanumber=KA-01239\">311 website</a>.", "topic": "Transportation", "ufd": "This dataset provides information on the locations and status of parking meters in New York City. Each record represents a single parking meter and includes details such as its meter number, current status (active or inactive), and pay-by-cell number. The dataset also specifies the hours of operation for each meter, the type of facility (on-street or off-street), and the borough in which it is located. Location information is provided through street names, side of the street, intersecting streets, latitude, and longitude. Computed regions are also included for more granular geographic analysis. This data can be used to analyze parking availability, identify areas with high meter utilization, or investigate parking meter issues.", "sfd": "Dataset Overview:\nThis dataset details the locations, operational status, and characteristics of parking meters throughout New York City. It includes attributes like meter ID, status (active/inactive), payment options, operational hours, and location details. Location information is provided through street addresses, coordinates, and computed regions.\n\nRelated Topics:\n- Parking Management\n- Urban Planning\n- Transportation Infrastructure\n- Geographic Data\n- Smart Cities\n\nConcepts and Synonyms:\n- Parking Meter: Pay station, parking device, meter\n- Status: Active, Inactive, Out of service, Operational status\n- Location: Latitude, Longitude, Street address, Intersection, Geographic coordinates\n- Pay-by-Cell: Mobile payment, Digital payment, App payment\n- Borough: City district, NYC borough (Manhattan, Brooklyn, etc.)\n\nApplications and Use Cases:\n- Analyze parking meter availability across different boroughs.\n- Identify areas with high parking meter utilization to optimize pricing.\n- Develop a mobile app to locate available parking meters.\n- Investigate parking meter malfunctions and identify areas needing maintenance.\n- Evaluate the impact of parking regulations on traffic flow."}
